{"id":60833,"date":"2015-06-08T06:26:28","date_gmt":"2015-06-08T13:26:28","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=60833"},"modified":"2018-10-03T03:32:59","modified_gmt":"2018-10-03T10:32:59","slug":"addressing-three-mooc-misgivings","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/","title":{"rendered":"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings"},"content":{"rendered":"<p><em>Below is a three-part series on Flourishing with Online Education by <a href=\"https:\/\/www.classcentral.com\/@lura\" target=\"_blank\">Lura Sanborn<\/a>. Lura is a research librarian for a prep school in central NH, where she teaches research skills &amp; sources, selects the library’s digital content and creates <a href=\"http:\/\/sps.libguides.com\/index.php\" target=\"_blank\">research guides<\/a>. In her free time she advocates for coconut-based ice-cream flavors at her husband’s <a href=\"http:\/\/www.nhchocolates.com\/\" target=\"_blank\">sweet shop<\/a> and dreams of a future filled with robots. Lura has authored two in-depth reviews on<a title=\"Class Central\" href=\"https:\/\/www.classcentral.com\/\" target=\"_blank\"> Class Central<\/a> (on <a href=\"https:\/\/www.classcentral.com\/report\/review-coursera-positive-psychology\/\" target=\"_blank\">Positive Psychology<\/a> and the <a href=\"https:\/\/www.classcentral.com\/report\/review-science-of-happiness-berkeley-ed\/\" target=\"_blank\">Science of Happiness<\/a>).<\/em><\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-image\"><p><a href=\"https:\/\/www.classcentral.com\/@lura\"><img loading=\"lazy\" class=\"alignnone wp-image-60856 size-thumbnail\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Lura-Sanborn-150x150.jpg\" alt=\"Lura Sanborn\" width=\"150\" height=\"150\" \/><\/a><\/p><\/blockquote>\n<p>Contemporary research is demonstrating that online is just as good if not better than in-person education. However, lots of legitimate concerns come up when people discuss it. Here are the three most common misgivings that I hear about online education, and my thoughts on them.<\/p>\n<h2>MOOC Misgiving #1: How good can MOOCs be if they have such a high dropout rate?<\/h2>\n<p>Many point to MOOCs as being unsuccessful because it has an 80%+ non-completion rate.  I would suggest that this is perhaps not a very refined measure. A better measure might be the completion rate of classes taken towards a degree program.  Arizona State University president Michael Crow’s experience with ASU’s online students points in this direction, with a retention rate of almost nine in 10 students.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-text\"><p>I would suggest completion rate is not a true measure of online education’s value<span class=\"cc-blockquote-border\"><br \/>\n<\/span><\/p><\/blockquote>\n<p>How about the completion rate of courses taken for professional development or self-enrichment?  I took Harvard’s <a href=\"https:\/\/www.classcentral.com\/mooc\/442\/edx-cs50x-introduction-to-computer-science\" target=\"_blank\">CS50x: Introduction to Computer Science<\/a> on the edX platform a few years ago.  While in this case I fell into that 80%, to me, the experience was successful.  I had signed up to get my feet wet and experience online education outside of a formal degree program, and to learn some code to apply to the back end of some research guides I was writing.  Check.  This educational consumer lens is overlooked in the 80% statistic, and given the multiple layers of motivation for taking an online class, I would suggest completion rate is not a true measure of online education’s value.<\/p>\n<p>As a broader, more telling example, the <a href=\"https:\/\/www.oclc.org\/home.en.html\" target=\"_blank\">Online Computer Library Center<\/a> (OCLC) found that in the last few years, about a quarter of U.S. adults with any amount of education beyond high-school have taken an online degree class. They reported that <em>“87% of those who have taken an online degree class indicated that their top goals were met.&#8221;<\/em> This high satisfaction level held constant for all age levels. A further 75%+ felt online learning was worth the investment of their time and dollars, surely this represents powerful measurement and feedback.<\/p>\n<p>One final thought on that 80% non-completion rate.  What if the on-campus classes at MIT were free?  How many people would sign up and how many would then finish?  It’s easy to sign up for a free class and then not feel concerned about wasting money by not completing the course.  What would the same equation look like if instead of MOOCs, free on-campus courses were made available?  I would guess there might be a similar ratio when comparing the completion charts of MOOCs and free on-campus courses.<\/p>\n<h2>MOOC Misgiving #2: How can you have quality education without face-to-face time between teachers and students?<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1.jpg\"><img loading=\"lazy\" width=\"800\" height=\"532\" class=\"alignnone size-full wp-image-60849\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1.jpg\" alt=\"UNIVERSITY_OF_THE_FRASER_VALLEY_PHOTOGRAPHY\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1.jpg 800w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1-300x200.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1-400x265.jpg 400w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Teachers-Facetime1-85x58.jpg 85w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><br \/>\n<\/a><a href=\"https:\/\/www.flickr.com\/photos\/ufv\/8042515604\" target=\"_blank\">Image via Flickr<\/a><\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-left cc-blockquote-text\"><p>Only 27% found the lack of physical face-to-face contact to be a challenge<span class=\"cc-blockquote-border\"><br \/>\n<\/span><\/p><\/blockquote>\n<p>I hear regularly that the loss of physical face-to-face interaction inherently equals a degraded educational experience. In looking for a documented loss when moving into a dominantly digital environment, I found the opposite view to be more convincing. Most recently, a defining new study compared an on-campus physics class at MIT to the free edX version of the course.  Researchers found no difference in measured learning outcomes between the online and the on-campus group, and that in fact, the online cohort did slightly better on homework than the on-campus group. The results were equally as uplifting in a July 2014 report from <a href=\"http:\/\/www.sr.ithaka.org\/\" target=\"_blank\">Ithaka S+R<\/a>, who, in a partnership with The University System of Maryland found that <em>“Students in the hybrid sections did as well or slightly better than students in the traditional sections in terms of pass rates and learning assessments,&#8221;<\/em> which held across disciplines and subgroups of students.  If online education, in its earliest stages, can produce measured results that meet or exceed those achieved in person, how valuable can the in-person, on-campus experience be? What do students think? That same OCLC whitepaper mentioned earlier found that of the online students surveyed, only 27% found the lack of physical face-to-face contact to be a challenge.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p>Online education puts the act of engaging in the hands of the student, easing away from the potential jeopardizition of learning that can come from relying on another to be inspiring, articulate, and meaningful.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>Gallup also has some thoughts on this.  In 2015, Shane J. Lopez, writing for Gallup says <em>“Half of the high school students we polled said they don&#8217;t have a single teacher who excites them about the future.”<\/em> Apparently the same sentiment is true for a third of college students, when reflecting on their professors.   Further eroding the perceived value of ‘live’ education, Lopez points to the Gallup study that found only 30% of K-12 public school teachers are engaged and 13% are “actively disengaged.”  I’m not sure where this unnamed professor would fall on that spectrum; from a comment on an Inside Higher Ed article: <em>“We have a history professor who&#8217;s been using the exact same lecture notes since he began teaching 30 years ago.”<\/em> Inspiring. Online education puts the act of engaging in the hands of the student, easing away from the potential jeopardizition of learning that can come from relying on another to be inspiring, articulate, and meaningful.<\/p>\n<h2>MOOC Misgiving #3: Isn&#8217;t online learning solitary and lonely?<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg\"><img loading=\"lazy\" width=\"742\" height=\"594\" class=\"alignnone size-full wp-image-60847\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg\" alt=\"Thoma Loneliness\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg 742w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness-300x240.jpg 300w\" sizes=\"(max-width: 742px) 100vw, 742px\" \/><br \/>\n<em>Hans Thoma [Public domain], via Wikimedia Commons<\/em><\/a><\/p>\n<p>While looking further to find quantified value of in-person groups and in-person group-work, I was more impressed with what <a href=\"http:\/\/www.quietrev.com\/\">Susan Cain<\/a> explains in her book <a href=\"http:\/\/www.amazon.com\/Quiet-Power-Introverts-World-Talking\/dp\/0307352153\" target=\"_blank\"><i>Quiet<\/i><\/a>, (in which she dismantles the myth of in-person group brainstorming being useful), <em>“…solitude can be a catalyst to innovation”<\/em>.  She quotes Hans Eysenck, psychologist, who said that introverted (read: lone-wolf) behavior boosts concentration and <em>“…prevents the dissipation of energy on social and sexual matters unrelated to work”<\/em>  (Eysenck, quoted in Cain).  How many of us are irritated or thrown off by the loud personality, the pot-stirrer, agitated by the malingerer, sneeze at the overly-perfumed, or simply find it intimidating to talk to an overly-beautiful colleague?  Imagine all of that gone, (either as a student or a teacher) and one’s focus and energy simply being poured into the work at hand, working without those social and physical distractors.<\/p>\n<p>Although we’ve been talking above about the power of working as an individual, as a boost to creativity, concentration, and mindfulness, it would appear that even brainstorming and collaboration is improved upon in the digital environment. In her 2012 <i>New York Times<\/i> article<i>,<\/i> Cain points to academic studies that found, when compared to working together in-person on group projects, the online environment creates both better productivity and better work output. In fact, for academics, <em>&#8220;teams whose members collaborate remotely, from separate universities, appear to be the most influential of all.”<\/em>  So while solo, independent work (a natural outcome of online coursework) is thought to be both more efficient and creative then in-person group work, collaboration is not only possible in the online environment, it appears to be more powerful for it.<\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-center cc-blockquote-text\"><p>The online environment creates both better productivity and better work output<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>In<a href=\"http:\/\/www.danpink.com\/\"> Dan Pink’s<\/a> influential work on motivation, he proposes that motivation is primarily comprised of autonomy, mastery and purpose.  One can imagine that the online environment heightens the autonomy leg of Pink’s motivation trifecta.The mastery component is supported with skills gained by taking an online course, perhaps amplified further by the gamification of online education, gaming success being naturally measured in competency. As for purpose, the election to take an online course was a purposeful decision as is the resultant execution of the class as well as any personal motivators, such as gaining credits or exploring an area of interest.  Motivation elements can also be found in the earning of badges, completing mastery matrices and tracking one’s personal course-completion chart. In sum, apparently we’ll not only learn better, collaborate better, and be more mindful and creative, but we’ll also be more motivated to learn using an online platform.<\/p>\n<p>If motivated, will high school students be more inclined to complete their degree program, and then go on to additional education?  Domestically, here in the U.S., almost half of high-school dropouts self-report deciding to drop out due to finding school boring. Is there opportunity to better address this boredom and lack of motivation to complete a degree, in the digital model?  If education becomes a student-driven, responsive model, with competency-based exercises and algorithmic suggestions on what classes to take next, will students remain in school?  How about students that are currently in school but are bored (fully 66% according to 2009 High School Survey of Student Engagement).  According to the same paper, <em>“five factors were likely to create a situation of learning instead of boredom: control, choice, challenge, complexity, and caring.”<\/em> Online education hits the first four of these necessary ingredients beautifully, and maybe there’s room in the digital classroom to cultivate caring (or perhaps a robotic tutor will have this attribute, or even, a student’s in-house human caregiver). This same report opens with a quote from a survey-participant student “When I am not engaged, it is because the work is not intellectually engaging.” The student is right of course, and research into the concept of ‘flow’ backs this statement. What better way to be engaged, to reach moments of intellectual flow, then a responsive educational environment that constantly pushes new, appropriately challenging content to the education consumer?<\/p>\n<p>Online has the ability to provide informational and educational equality, and get us closer to an educational purity of purpose, universally, in a way never seen before, and we’ve only just begun building the potential of what online education can be! Existing research in the fields of creativity, collaboration and motivation point to why online education could become a superior model based on innate human tendencies. No longer must access to quality instruction, research and information be exclusive to the geography of ivory towers.  What will we accomplish with that ivory tower at our collective fingertips?  I am savoring the anticipation of a unstoppably enlightened, <em>magnificently flourishing future<\/em> for our human species.<\/p>\n<h2>References<\/h2>\n<p>Bridgeland, John M., John J. Dilulio, Jr., and Karen Burke Morison. <i>The Silent Epidemic: Perspectives of High School Dropouts<\/i>. Bill &amp; Melinda Gates Foundation, 2006. PDF.<br \/>\n<a href=\"https:\/\/docs.gatesfoundation.org\/Documents\/thesilentepidemic3-06final.pdf\">https:\/\/docs.gatesfoundation.org\/Documents\/thesilentepidemic3-06final.pdf<\/a><\/p>\n<p>Cain, Susan. <i>Quiet: The Power of Introverts in a World That Won&#8217;t Stop Talking<\/i>. New York: Broadway Books \/ Random House, 2013.<\/p>\n<p>&#8220;<a href=\"http:\/\/www.nytimes.com\/2012\/01\/15\/opinion\/sunday\/the-rise-of-the-new-groupthink.html?pagewanted=all&amp;_r=0.\" target=\"_blank\">The Rise of the New Groupthink<\/a>.&#8221; <i>The New York Times<\/i>, January 12, 2012, Sunday Review. Accessed July 13, 2014.<\/p>\n<p>Colvin, Kimberly F., John Champaign, Alwina Liu, Qian Zhou, Colin Fredericks, and David E. Pritchard. &#8220;Learning in an Introductory Physics MOOC: All Cohorts Learn Equally, including an On-campus Class.&#8221; <i>The International Review of Research in Open and Distance Learning<\/i> 15, no. 4 (2014). <a href=\"http:\/\/www.irrodl.org\/index.php\/irrodl\/article\/view\/1902\/3009\">http:\/\/www.irrodl.org\/index.php\/irrodl\/article\/view\/1902\/3009<\/a>.<\/p>\n<p>Commenter: Cow Eye Community College. &#8220;<a href=\"https:\/\/www.insidehighered.com\/blogs\/world-view\/will-professors-teach-differently-10-years#at_pco=smlwn-1.0&amp;at_si=555f286cf58c54ae&amp;at_ab=per-12&amp;at_pos=0&amp;at_tot=1.\" target=\"_blank\">Will Professors Teach Differently in 10 Years?<\/a>&#8221; <i>Inside Higher Ed<\/i>, The World View. Accessed May 22, 2015.<\/p>\n<p>Mihaly Csikszentmihalyi, &#8220;<a href=\"http:\/\/www.ted.com\/talks\/mihaly_csikszentmihalyi_on_flow?language=en.\" target=\"_blank\">Flow, The Secret of Happiness<\/a>&#8221; video file, 18:55, TED, February 2004, accessed May 27, 2015<\/p>\n<p>Griffiths, Rebecca, Matthew Chingos, Christine Mulhern, and Richard Spies. <i>Interactive Online Learning on Campus: Testing MOOCs and Other Platforms in Hybrid Formats in the University System of Maryland<\/i>. Ithaka. 2014. PDF.<\/p>\n<p>Kiener, R. &#8220;Future of Public Universities.&#8221; <i>CQ Researcher<\/i>, January 18, 2013, 53-80. http:\/\/library.cqpress.com\/.<\/p>\n<p>Lewin, Tamar. &#8220;<a href=\"http:\/\/www.nytimes.com\/2012\/03\/05\/education\/moocs-large-courses-open-to-all-topple-campus-walls.html?pagewanted=all&amp;_r=0.\" target=\"_blank\">Instruction for Masses Knocks down Campus Walls<\/a>.&#8221; <i>The New York Times<\/i>, March 4, 2012. Accessed July 13, 2014.<\/p>\n<p>Lopez, Shane J. &#8220;<a href=\"http:\/\/www.gallup.com\/opinion\/gallup\/181610\/wanted-inspiring-teachers-professors.aspx?utm_source=WWWV7HP&amp;utm_medium=topic&amp;utm_campaign=tiles.\" target=\"_blank\">Wanted: Inspiring Teachers and Professors<\/a>.&#8221; Gallup. Last modified February 17, 2015. Accessed May 9, 2015<\/p>\n<p>OCLC. <i>At a Tipping Point: Education, Learning and Libraries<\/i>. 2014. PDF.<\/p>\n<p>Pink, Daniel H. <i>Drive: The Surprising Truth about What Motivates Us<\/i>. NY, NY: Riverhead Books, 2011.<\/p>\n<p>Yazzie-Mintz, Ethan. <i>High School Survey of Student Engagement<\/i>. Compiled by Indiana University Center for Evaluation &amp; Education Policy. 2009. PDF.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education. <\/p>\n","protected":false},"author":8,"featured_media":60849,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[638],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings — Class Central<\/title>\n<meta name=\"description\" content=\"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings\" \/>\n<meta property=\"og:description\" content=\"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2015-06-08T13:26:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-10-03T10:32:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"742\" \/>\n\t<meta property=\"og:image:height\" content=\"594\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Lura Sanborn\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg\",\"width\":742,\"height\":594},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/\",\"name\":\"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#primaryimage\"},\"datePublished\":\"2015-06-08T13:26:28+00:00\",\"dateModified\":\"2018-10-03T10:32:59+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/111a95707529fdbc45dc70912f04d27d\"},\"description\":\"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/111a95707529fdbc45dc70912f04d27d\",\"name\":\"Lura Sanborn\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/2ddfae14e032638151ce31e83dee7aa5?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/2ddfae14e032638151ce31e83dee7aa5?s=96&d=mm&r=g\",\"caption\":\"Lura Sanborn\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/lura\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings — Class Central","description":"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/","og_locale":"en_US","og_type":"article","og_title":"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings","og_description":"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.","og_url":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2015-06-08T13:26:28+00:00","article_modified_time":"2018-10-03T10:32:59+00:00","og_image":[{"width":742,"height":594,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Lura Sanborn","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Thoma-Loneliness.jpg","width":742,"height":594},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#webpage","url":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/","name":"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#primaryimage"},"datePublished":"2015-06-08T13:26:28+00:00","dateModified":"2018-10-03T10:32:59+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/111a95707529fdbc45dc70912f04d27d"},"description":"In Part 1 of this Opinion Series: Flourishing with Online Education, Lura Sanborn discusses three common misgivings she hears about MOOCs and online education.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/addressing-three-mooc-misgivings\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Flourishing with Online Education (Part I): Addressing Three MOOC Misgivings"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/111a95707529fdbc45dc70912f04d27d","name":"Lura Sanborn","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/2ddfae14e032638151ce31e83dee7aa5?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/2ddfae14e032638151ce31e83dee7aa5?s=96&d=mm&r=g","caption":"Lura Sanborn"},"url":"https:\/\/www.classcentral.com\/report\/author\/lura\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60833"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=60833"}],"version-history":[{"count":19,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60833\/revisions"}],"predecessor-version":[{"id":66944,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60833\/revisions\/66944"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/60849"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=60833"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=60833"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=60833"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}