{"id":60896,"date":"2015-06-15T22:56:31","date_gmt":"2015-06-16T05:56:31","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=60896"},"modified":"2015-06-16T08:26:16","modified_gmt":"2015-06-16T15:26:16","slug":"futurelearn","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/futurelearn\/","title":{"rendered":"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn"},"content":{"rendered":"<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-image\"><p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Simon-Nelson.jpg\"><img loading=\"lazy\" class=\"alignnone  wp-image-60936\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Simon-Nelson.jpg\" alt=\"Simon Nelson\" width=\"211\" height=\"295\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Simon-Nelson.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/Simon-Nelson-214x300.jpg 214w\" sizes=\"(max-width: 211px) 100vw, 211px\" \/><\/a><\/p><\/blockquote>\n<p>The massively open online course <a href=\"https:\/\/www.futurelearn.com\/courses\/understanding-ielts\/\">Understanding IELTS: Techniques for English Language Tests<\/a>, taught by the British Council, and offered by UK-based MOOC provider FutureLearn, appeals to learners across the world that are interested in studying for English language exams. The single session of this MOOC had over 400,000 sign-ups, like a <a href=\"https:\/\/about.futurelearn.com\/press-releases\/futurelearn-delivers-the-largest-mooc-ever-as-nearly-400000-learners-convene-for-english-language-learning\/\" target=\"_blank\">a record-setting enrollment<\/a> for a single course session. Yet this wasn&#8217;t in 2012&#8211;the “Year of the MOOC”, at the height of the MOOC hype cycle&#8211;it was last month, the course started in May of 2015. This shows a few things: a) English language skills are in high demand, b) MOOCs aren’t dead yet, and c) FutureLearn is a legit player in MOOCs. To discuss this third point in more detail, Class Central sat down and spoke with Simon Nelson, CEO of <a href=\"https:\/\/www.futurelearn.com\/\">FutureLearn<\/a> via webchat.<\/p>\n<p><a href=\"https:\/\/www.futurelearn.com\/\" target=\"_blank\">FutureLearn<\/a>, based out of the UK, went live in 2013 and follows the model of Coursera or edX, partnering with top universities to offer courses online to offer free to the public. Simon describes the mission of FutureLearn:<\/p>\n<p style=\"padding-left: 120px;\"><i>We are passionate about opening up education to people all over the world to taking some of the best content from the best organizations in the world and making it more accessible, delivering it in new ways and helping those institutions to take advantage of all the opportunities that digital offers them<\/i><\/p>\n<blockquote class=\"cc-blockquote cc-blockquote-right cc-blockquote-text\"><p>FutureLearn passed a significant milestone: the number of learners from outside the UK surpassed the number inside it.<span class=\"cc-blockquote-border\"> <\/span><\/p><\/blockquote>\n<p>Although most of its partners are in the UK, this is changing, with a growing number of university partners outside of the UK (including <a href=\"https:\/\/about.futurelearn.com\/press-releases\/futurelearn-invites-specialists-to-create-courses-in-a-range-of-disciplines\/\" target=\"_blank\">11 recently announced partners<\/a>). Last October, FutureLearn passed a significant milestone: the number of learners from outside the UK surpassed the number inside it, and now stands at 60%. So FutureLearn is starting to look more similar to Coursera and edX, with a stronger regional emphasis. However, that regional emphasis is diminishing, as Simon notes:<\/p>\n<p style=\"padding-left: 120px;\"><i>We certainly started as a UK company with UK university partners, but our ambitions were always global in terms of reaching a global audience and opening up the reach of those institutions internationally<\/i><\/p>\n<p>Like Coursera and edX, FutureLearn currently earns revenues by offering optional paid certificates for some courses which participants can use to indicate completing and passing the course. Besides this similarity to Coursera and edX, there are some differences as well. They can be grouped into four categories:<\/p>\n<p style=\"padding-left: 120px;\"><b>• Origin:<\/b> FutureLearn is a wholly-owned subsidiary of the UK’s Open University, which has a history of teaching online. Also important was the selection of Simon Nelson as CEO, who came from the BBC where he oversaw digital projects<\/p>\n<p style=\"padding-left: 120px;\"><b>• Approach:<\/b> FutureLearn has a design-oriented approach to its interface and user experience and has made enabling social interaction a strong priority<\/p>\n<p style=\"padding-left: 120px;\"><b>• Content:<\/b> Courses are often conceived differently from university courses, with subjects that are highly topical, and course length varying widely<\/p>\n<p style=\"padding-left: 120px;\"><b>• Audience:<\/b> FutureLearn attracts an audience that is socially active, increasingly global, and also happens to be 60% female<\/p>\n<p>We’ll describe each of these aspects in more detail and share Simon’s thoughts on them.<\/p>\n<h2><b>The Origin Story: Online Pedagogy Meets Digital Media<\/b><\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-1.jpg\"><img loading=\"lazy\" width=\"979\" height=\"657\" class=\"alignnone size-full wp-image-60937\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-1.jpg\" alt=\"FutureLearn\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-1.jpg 979w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-1-300x201.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-1-85x58.jpg 85w\" sizes=\"(max-width: 979px) 100vw, 979px\" \/><\/a><\/p>\n<p>Unlike Coursera, a venture-backed for-profit, and edX, a nonprofit, FutureLearn is a for-profit entity that is wholly-owned by the UK’s <a href=\"http:\/\/www.open.ac.uk\/\">Open University<\/a>, an institution that serves almost 200,000 students. Thus, it needs to find revenues in order to sustain itself and grow, but also is mission-oriented. FutureLearn also benefits from the Open University’s long experience in online learning&#8211;Simon cites the example of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Mike_Sharples\">Prof. Mike Sharples<\/a>, a leading authority on educational technology. He further elaborates:<\/p>\n<p style=\"padding-left: 120px;\"><i>We were deliberately set up as a startup separate from The Open University and ordered to run as fast as we could and innovate beyond the university, but to draw on any of their resources. The Open University’s been central to the establishment of our mission, our philosophy but also our approach to product development and the learning experience. The areas we really went to The Open University for were their educational technology, their understanding of online pedagogies. <\/i><\/p>\n<p>Prior to FutureLearn, Simon Nelson worked at the BBC (British Broadcasting Corporation), where he oversaw many of its digital initiatives. The BBC is widely acknowledged as a world-class media organization, known for both its top-quality content as well as high production quality. Clearly, selecting Simon to lead the company was a deliberate choice to take FutureLearn in a high production-value and consumer-centric direction.<\/p>\n<h2><b>A Deft Approach: Design-Centered and Social Learning Focused<\/b><\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg\"><img loading=\"lazy\" width=\"841\" height=\"560\" class=\"alignnone size-full wp-image-60938\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg\" alt=\"FutureLearn 2\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg 841w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2-300x200.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2-400x265.jpg 400w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2-85x58.jpg 85w\" sizes=\"(max-width: 841px) 100vw, 841px\" \/><\/a><\/p>\n<p>On the FutureLearn <a href=\"https:\/\/www.futurelearn.com\/\" target=\"_blank\">website<\/a>, there is ample whitespace, simple navigation, and lack of extraneous lines and borders, which points to a very strong design philosophy (an additional clue is that FutureLearn employees periodically post design inspirations on their blog). There is a pedagogical aspect to this design approach: the minimalist design is suggestive of the simplicity of what it is like to learn on the platform. The lack of visual clutter keeps your mind clear for the learning content that should be the focus of your attention. Simon explains the importance of design:<\/p>\n<p style=\"padding-left: 120px;\"><i>We just wanted to make this a modern, simple, attractive experience. I think we’ve succeeded in that. I had user experience design ingrained into me quite early on at BBC and it was in the blood of a number of the first people that came on board and conceptualized FutureLearn. We hired a great design agency really early on, who gave us a fantastic visual identity. Strong design is something that I’m very happy to put central to the FutureLearn experience and we think it’s going to be an important point of differentiation and one that we keep building on.<\/i><\/p>\n<p>This carries over into the way FutureLearn designs for social learning. Although the interaction is primarily through discussion comments, unlike in most MOOC platforms, discussion can happen on any of the content pages (versus going to separate forums). Though these types of social features are being introduced (and have been present in some platforms for a while, such as Australia-based <a href=\"https:\/\/www.classcentral.com\/report\/openlearning-adam-brimo\/\">OpenLearning<\/a>), FutureLearn has applied a deft hand to its social elements. Simon says:<\/p>\n<p style=\"padding-left: 120px;\"><i>We feel that we just took it up a dial, we made sure that every bit of content on the site, in every course stimulated and encouraged a discussion and that discussion took place alongside that content. We didn’t send you off to a separate environment. We’ve started to take the principles of a social network and bring them into the learning experience as well: the ability to follow people, like each other&#8217;s comments, reply directly to each other. We realized we are only at the start of what is possible with social learning, but we think that we have really created a great experience around that<\/i><\/p>\n<h2><b>Content Relevance: Pursuing the Classic and the Current<\/b><\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-3.jpg\"><img loading=\"lazy\" width=\"923\" height=\"568\" class=\"alignnone size-full wp-image-60939\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-3.jpg\" alt=\"FutureLearn 3\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-3.jpg 923w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-3-300x185.jpg 300w\" sizes=\"(max-width: 923px) 100vw, 923px\" \/><\/a><\/p>\n<p>Perhaps the thing that stands out most about FutureLearn courses is that while many seem to be closely modeled on standard university courses, it is clear that there is experimentation with new types of content&#8211;both in diversity &amp; timeliness of topics. There is no fear of making courses short if needed: several FutureLearn courses are only two weeks long&#8211;something that you see in other types of online learning, but not often among MOOCs. The subjects can also be highly topically relevant, more than seems feasible in a university course planning process. Here is a sampling of some topics:<\/p>\n<p style=\"padding-left: 90px;\"><a href=\"https:\/\/www.classcentral.com\/mooc\/1257\/futurelearn-muslims-in-britain-changes-and-challenges\">• Muslims in the Britain: Change and Challenges<br \/>\n<\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/1257\/futurelearn-muslims-in-britain-changes-and-challenges\">• <\/a>Two Ebola courses (two weeks long): <a href=\"https:\/\/www.classcentral.com\/mooc\/3003\/futurelearn-ebola-in-context-understanding-transmission-response-and-control\">Ebola in Context: Understanding Transmission, Response and Control<\/a> and <a href=\"https:\/\/www.classcentral.com\/mooc\/3002\/futurelearn-ebola-symptoms-history-and-origins\">Ebola: Symptoms, History, and Origins<br \/>\n<\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/1257\/futurelearn-muslims-in-britain-changes-and-challenges\">• <\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/2991\/futurelearn-shale-gas-and-fracking-the-politics-and-science\">Shale Gas and Fracking: The Politics and Science<br \/>\n<\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/1257\/futurelearn-muslims-in-britain-changes-and-challenges\">• <\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/2325\/futurelearn-world-war-1-trauma-and-memory\">WWI In Trauma and Memory<\/a> (first in a series of five courses)<br \/>\n<a href=\"https:\/\/www.classcentral.com\/mooc\/1257\/futurelearn-muslims-in-britain-changes-and-challenges\">• <\/a><a href=\"https:\/\/www.classcentral.com\/mooc\/2121\/futurelearn-towards-scottish-independence-understanding-the-referendum\">Towards Scottish Independence? Understanding the Referendum<\/a><\/p>\n<p>The timing of the last course in the list on Scottish Independence was scheduled so that the actual referendum vote in Scotland would fell in the middle of the course—participants discussed it beforehand, saw the results of the votes, and then discussed the results.<\/p>\n<p>The highly topical nature of these courses, and the fact that most were just four weeks long shows clearly that FutureLearn gets this important point: to meet the diverse needs of the general population, mimicking a college campus course doesn&#8217;t always fit.<\/p>\n<h2><b>An Audience Assembled: Diverse Peoples and Paths<\/b><\/h2>\n<p>Similar to MOOC audiences within Coursera and edX, the majority of those taking FutureLearn MOOCs have a college degree (in this case an estimated 70%). But Simon points out that even some of them have unfulfilled educational needs:<\/p>\n<p style=\"padding-left: 120px;\"><i>Large numbers of people feel they did the wrong degree at university, or wish they’d done another degree or people who didn’t do a degree wish they had done. I delight in the fact that we are bringing high quality university learning back to people who thought that, this was an option that was lost to them years back&#8230;I just love the fact that we’re opening up education for everyone.<\/i><\/p>\n<p>He points to the wide diversity of participants, from those picking up specific career skills, such as dental photography, to teachers who are taking courses for professional development, to personal enrichment. There is also strong gender diversity, with 60% female participants. Simon loves the diversity among FutureLearn learners:<\/p>\n<p style=\"padding-left: 120px;\"><i>We’ve got a whole lot of niche courses in areas that are clearly valuable for professional development, that’s the key motivation. But we also know that people are learning just for the delight of learning and to open up subjects like history and literature in new ways. We get all sorts of inspiring stories about people, older people who find it a fantastic way of re-energizing their gray cells as they often tell us, but also people with disabilities, with very challenging circumstances.<\/i><\/p>\n<p>Thus, don’t be misled by the 70% degreed figure—these courses are not all just nice-to-haves for middle class professionals looking for a little cultural enrichment by watching a few videos. There are also the 30% without degrees, for whom these courses hopefully further their educational or career goals. Some of these participants are high school students, which are grouped into a collection called <a href=\"https:\/\/www.futurelearn.com\/collections\/choices\">FutureLearn Choices<\/a> to highlight these. And let’s not forget the biggest course yet, on the IELTS exam—you can bet that almost all of the 400,000+ people who enrolled in this are viewing the course as a tangible way to help them reach their goals.<\/p>\n<h2><b>The Path Ahead for FutureLearn<\/b><\/h2>\n<p>Given the above, FutureLearn seems to be on pace to continue its impressive expansion, widening both its content partner base and audience of learners around the world. There is surely much room for further growth. But there is a question that is looming on the horizon for these MOOC platforms: what happens when the best universities are already partnered up with MOOC platforms? Will they then start working with more and more mid-tier schools? Surely there is great teaching happening there as well, but perhaps less consistently. Or will the focus be on producing more and better courses at the top universities? And while some universities are willing to mix-and-match MOOC platforms (e.g. Stanford, Harvard, Michigan), it seems that MOOC platform providers are going to be operating in a very competitive environment.<\/p>\n<p>It seems that FutureLearn is taking the right approach to facing this future: it has taken a unique perspective on online learning and crafts its offering on that basis. Among the major providers, Coursera clearly leads in brand recognition, with strong university partnerships, and the ability to draw the most learners; edX leads in platform extensibility and data analytics &amp; research; Udacity leads in teaching job-relevant technical skills; NovoEd leads in group-based collaboration; iversity leads in pursuing European credit attainment. And it is clear that FutureLearn is distinctive in fostering social engagement on topical content in a simple, elegant environment.<\/p>\n<p>More important than what FutureLearn offers now, however, is a willingness to experiment and innovate, in pursuit of its mission. Another avenue of large potential growth and value is partnering with other types of institutions, as exemplified by partnerships with the BBC, the British Council, and the British Museum. There are numerous treasured institutions around the world that could partake in these types of educational opportunities, especially about highly topical content. Whichever direction it grows, it will be its mission, safeguarded by the 100% ownership by The UK Open University, that will be the motivating force behind what FutureLearn does. As Simon describes it:<\/p>\n<p style=\"padding-left: 120px;\"><i>The reason I’ve been able to hire a high quality world class team down there is they’re fired up about opening education to the world. I want to keep that central to our mission but pull off the trick of delivering a sustainable successful business at the same time. We think we’re just scratching the surface of what’s possible, and we’re going to be doing some really exciting stuff over the next year or two.<\/i><\/p>\n<p>On behalf of learners everywhere, we want to express thanks for FutureLearn’s valuable efforts thus far in enabling new learning experiences, and to encourage them to keep growing and innovating. We look forward to seeing Futurelearn’s journey—Class Central will be watching every step along the way.<\/p>\n<p>If you are interested, you can check out <a href=\"https:\/\/www.futurelearn.com\">FutureLearn<\/a> courses for yourself!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform<\/p>\n","protected":false},"author":3,"featured_media":60938,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[8],"tags":[43,226],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn — Class Central<\/title>\n<meta name=\"description\" content=\"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/futurelearn\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn\" \/>\n<meta property=\"og:description\" content=\"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/futurelearn\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2015-06-16T05:56:31+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2015-06-16T15:26:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"841\" \/>\n\t<meta property=\"og:image:height\" content=\"560\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Charlie Chung\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg\",\"width\":841,\"height\":560},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/\",\"name\":\"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/#primaryimage\"},\"datePublished\":\"2015-06-16T05:56:31+00:00\",\"dateModified\":\"2015-06-16T15:26:16+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159\"},\"description\":\"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/futurelearn\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/futurelearn\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159\",\"name\":\"Charlie Chung\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g\",\"caption\":\"Charlie Chung\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/charlie\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn — Class Central","description":"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/futurelearn\/","og_locale":"en_US","og_type":"article","og_title":"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn","og_description":"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform","og_url":"https:\/\/www.classcentral.com\/report\/futurelearn\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2015-06-16T05:56:31+00:00","article_modified_time":"2015-06-16T15:26:16+00:00","og_image":[{"width":841,"height":560,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Charlie Chung","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/futurelearn\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2015\/06\/FutureLearn-2.jpg","width":841,"height":560},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/futurelearn\/#webpage","url":"https:\/\/www.classcentral.com\/report\/futurelearn\/","name":"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/futurelearn\/#primaryimage"},"datePublished":"2015-06-16T05:56:31+00:00","dateModified":"2015-06-16T15:26:16+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159"},"description":"Class Central interviews Futurelearn CEO Simon Nelson on four distinctive aspects of the Futurelearn MOOC platform","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/futurelearn\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/futurelearn\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/futurelearn\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"The MOOC Platform with a Twist: The Emergence of UK-Based FutureLearn"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/3d7f835195b15646a50778cf7c81d159","name":"Charlie Chung","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/895499fc7b283d0d4f3d459da24fdb76?s=96&d=mm&r=g","caption":"Charlie Chung"},"url":"https:\/\/www.classcentral.com\/report\/author\/charlie\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60896"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=60896"}],"version-history":[{"count":7,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60896\/revisions"}],"predecessor-version":[{"id":60945,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/60896\/revisions\/60945"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/60938"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=60896"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=60896"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=60896"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}