{"id":64112,"date":"2016-09-14T21:55:21","date_gmt":"2016-09-15T04:55:21","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=64112"},"modified":"2018-10-03T09:15:29","modified_gmt":"2018-10-03T16:15:29","slug":"european-leaders-edtech-think-state-moocs-part-1","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/","title":{"rendered":"What European Leaders in EdTech Think of the State of MOOCs: Part I"},"content":{"rendered":"<p>Created in 1985 to showcase the applications of information technology in education, the BETT (British Educational Training and Technology Show) has progressively become one of the most important edtech exhibitions by its scale. It has gathered 35,000 educators and professionals from the sector in ExCeL, London. In between two iterations of the show, I talked to several European edtech leaders (representatives from FutureLearn, JISC, Open University, UCL Institute of Education, and so on) to get a “pulse” on the state of online learning in 2016. These discussions coalesced into several trends, which we will cover in a three part series.<\/p>\n<p>In this part, we will cover two trends:<\/p>\n<ol>\n<li>MOOCs have found their place &#8230; within a broader edtech environment, and<\/li>\n<li>Learning Management System fever.<\/li>\n<\/ol>\n<hr \/>\n<h2>Trend 1: MOOCs have found their place &#8230; within a broader edtech environment<\/h2>\n<p><span style=\"line-height: 1.42857;\">MOOCs are inserted within broader learning environments, such as on-campus programs, schools, and so on. Their place is more of a &#8220;resource 3.0,&#8221; complementary to others, than being a self-sustained or autonomous pedagogic item. This is partially in reaction to their shortcomings in terms of social interactions and sense of belonging to a community of learners.<\/span><\/p>\n<p><strong><a href=\"https:\/\/twitter.com\/willwoods\">Will Woods<\/a> (Head of Learning and Teaching Technology, IET, Open University)<\/strong><\/p>\n<p>I found the BETT experience fascinating and really enjoyed talking about internationalization. The speakers did cover MOOCs as a way to reach out to international learners; however, the hype around MOOCs has now turned into a more considered review of where they add value. At the Open University we have been expending considerable effort in the development of Badged Open Courses (BOCs), as well as developing MOOCs on FutureLearn; this reflects an evolution of thinking around open pedagogy and how this can be applied, since we are experimenting with BOCs as a means to provide an accreditation pathway through to more formal programs of study (or to act as a standalone proposition for work-based learning).<\/p>\n<p>Leeds University and the Open University are amongst the first to create, with FutureLearn, pathways to allow students to study part of their degree through MOOCs. MOOC platforms have also allowed us to consider how to enhance teaching practice through more direct authoring, and through empowering the academic to think more creatively about online teaching. MOOCs do offer value within the curriculum, and they allow educators to think more radically about offering learning to people who would not consider the proposition of a degree. However, the difference in quality is massive between the best and the worst examples [of MOOCs].<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/will-woods.jpg\"><img class=\"wp-image-63896\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/will-woods-1024x768.jpg\" width=\"100%\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/will-woods.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/will-woods-300x225.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/will-woods-768x576.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><em>Will Woods at the Distance Learning Within Your Institution panel.<\/em><\/p>\n<p><strong>Neil Harvey (FutureLearn)<\/strong><\/p>\n<p>I think this is true. The notion of a MOOC platform replacing schools and universities as a means of teaching has, luckily, disappeared. MOOCs are certainly being inserted into broader learning environments in schools and businesses, in which blended learning and the &#8220;flipped classroom&#8221; model are widely adopted. But rather this than being due to the shortcomings of social interactions between learners, at FutureLearn we believe it is social interaction that drives effective learning. We prefer to be known as a <em>social learning platform<\/em> (as opposed to a MOOC platform), because what differentiates us from other platforms is that we focus on creating a sense of belonging for our community of learners. At the end of every step in a course (a &#8220;step&#8221; being a piece of learning content), we encourage all learners on the course to go and discuss what they have just learned with each other. And we don’t send learners off to a forum or discussion group to do so, which enables a wall of conversation to open up around the step itself.<\/p>\n<p><strong><a href=\"https:\/\/twitter.com\/yishaym\">Yishay Mor<\/a> (PAU Education \/ Levinsky Teachers&#8217; College)<\/strong><\/p>\n<p>There&#8217;s a process of mainstreaming of MOOCs. At first, universities laughed at them, then they became a threat, and now — more and more — they integrate them into their curriculum program. MOOCs clearly address needs that aren&#8217;t covered by the traditional system, and the traditional system addresses needs that MOOCs can&#8217;t cover, so there are a lot of synergies between the two.<\/p>\n<p>For example, some universities offer preparatory courses in the form of MOOCs. Arizona State University even decided to go at it full-on with their first-year-as-a-MOOC idea.<\/p>\n<p>A use case we see more and more is using MOOCs as a textbook, in the vein of the flipped classroom model, like &#8220;<span lang=\"EN-US\">please do week 1 and week 2 of this MOOC as your course assignment for next session.&#8221;<\/span> The advantage is that the teacher can see where the students had problems, thanks to analytics.<\/p>\n<p>We also see many universities using MOOCs from others, like MIT or Stanford, and not being shy about using the resources produced by institutions that have far more budget than they do.<\/p>\n<p>All in all, this kind of combination is really powerful. This is because the problem of MOOCs, with their low attrition rate, is that they are a lonely experience. But if you take a MOOC with your university cohort, you have both the content and the social experience, as well as the support. You can also see all this with organizations working with refugees, for instance, who are building social support structures in MOOCs.<\/p>\n<p>Nonetheless, the social element is a nice idea but it&#8217;s difficult to implement. For example, edX is trying to do this with their cohorting system, but most of their courses aren&#8217;t social.<\/p>\n<p>My prediction: the team and cohort structures will be more relevant in the Specialization\/Series that can span whole semesters. It&#8217;s more challenging to form significant social ties for three week courses, but it starts to make sense if you do a package of courses, and if somewhere down the line you have real-life meetups, student centers, and so on, it&#8217;s even better.<\/p>\n<p><strong><a href=\"https:\/\/twitter.com\/laiaalbo\">Laia Albó<\/a> (Interactive Technologies Group — Learning Technologies — from the Universitat Pompeu Fabra, Barcelona)<\/strong><\/p>\n<p>Last January I participated in BETT, and I delivered a talk about Blended MOOCs (bMOOCs): the use of MOOC content and activities as part of face-to-face university courses (see the presentation <a href=\"http:\/\/www.slideshare.net\/LaiaAlb\/mooc-videos-in-blended-learning-practices-laia-albo-65587407\">here<\/a>). I think bMOOCs are an emerging practice in higher education which needs to be explored, considering that professors are making a big effort to develop MOOCs whilst reconsidering how they can reuse and leverage all this work beyond the online courses. MOOCs can be used in a variety of blended combinations: for instance, MOOC videos can be used in a video-based learning approach within formal courses on-campus. The resulting methodology is hybrid, typically considered as a “flipped classroom” approach where students watch lectures in the form of videos outside the classroom, and the physical classroom is reserved for practical activities. Yet it is also possible to use videos in a hands-on class as a support tool, or put MOOCs completely online as remedial courses, and so forth. These approaches can help students to become more autonomous by allowing them greater flexibility in determining their learning path while accessing professors’ explanations if necessary. As a result, they lead to a type of student-centered learning that gets away from the traditional classroom.<span class=\"cc-blockquote-border\"><br \/>\n<\/span><br \/>\n<a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/laia.jpg\"><img class=\"wp-image-63897\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/laia-1024x759.jpg\" alt=\"laia\" width=\"100%\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/laia-1024x759.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/laia-300x222.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/laia-768x569.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a> <em>Laia Albo on the use of MOOC videos within universities&#8217; blended learning practices.<\/em><\/p>\n<p><strong><a href=\"https:\/\/twitter.com\/Susanna_metid\">Susanna Sancassani<\/a> (Managing Director, METID-Politecnico di Milano)<\/strong><\/p>\n<p>Since the very first day of the development of the MOOC phenomenon, e-learning experts expressed a high level of consensus about the fact that the main effect of MOOCs would have been their impact on face-to-face methodologies. The “blended approach” seems now to be the more relevant effect, because it can take advantage of a methodology that&#8217;s very easy to understand for everybody — that’s the “flipped classroom” approach. However, there are a lot of subtle impacts that are more difficult to read, but which are perhaps more relevant, which are related to the practices that the students are developing on their own.<\/p>\n<p>For example, a growing number of students are developing the habit of reviewing contents and integrating the comprehension of on-campus courses by using online materials provided by MOOCs that they find without any support provided by teachers, and sometimes they find MOOCs more effective and more clear than their on-campus teachers. In some disciplines, particularly related to ICT, a growing number of students are considering the training provided by MOOCs to be more interesting and up-to-date, and more conducive to fostering their employable skills. It would be interesting to go deeper in how this self-directed use of MOOCs, developed by students, is actually modifying the teaching-learning dynamics in universities (see <a href=\"https:\/\/prezi.com\/2nlyebakcurr\/from-uni-versities-to-multi-versities\/?utm_source=twitter&amp;utm_medium=landing_share\">Susanna&#8217;s Prezi on how MOOCs can help repositioning universities at the heart of knowledge production and re-production process<\/a>)<span class=\"cc-blockquote-border\"><br \/>\n<\/span><\/p>\n<p><strong><a href=\"https:\/\/twitter.com\/thinksitthrough\">Diana Laurillard<\/a> (Professor of Learning with Digital Technology, Knowledge Lab, UCL)<\/strong><\/p>\n<p>Part of the message of both my sessions on MOOCs at BETT was that — contrary to expectations — MOOCs are, as Neil Harvey says, a social learning platform. We’ve found how valuable that is for our MOOCs on teacher professional development: this knowledgeable group of participants provide huge value for each other; the course is orchestrated by us, but the value goes well beyond what we can provide, because they share what they know. It’s no accident that we switched from Coursera to FutureLearn as soon as we could — the latter is much more oriented towards meaningful discussions among the participants.<span class=\"cc-blockquote-border\"> <\/span><\/p>\n<h2 style=\"text-align: justify;\">Trend 2: Learning Management System fever<\/h2>\n<p style=\"text-align: justify;\">There has been a multiplication of Learning Management Systems (LMS), differentiating themselves through the market they pursue (kids, adults and so on) and the features they offer (security\/compliance driven, simplicity, open and flexible, and so on). I am wondering if there is a risk of dispersal\/scattering by having too many LMSs on the market, especially if they aren&#8217;t interoperable. Actually, several teachers I met at the fair expressed their fear of being locked on a LMS and being in a situation where they&#8217;re struggling to transfer their work on another one.<strong><br \/>\n<\/strong><\/p>\n<p><strong>Neil Harvey (FutureLearn)<\/strong><\/p>\n<p>We agree that the challenge for schools, as well as for businesses, is that once they commit to a specific LMS solution, they are pretty much locked in to that platform for a fixed period of time. LMSs can quickly become outdated and complicated to manage, and it’s difficult to create a good user experience. We pride ourselves on our user-centric approach, and will spend time testing and learning to see which features will most benefit our learners. Ultimately we see ourselves as part of a learning ecosystem; where solutions fit with our social learning mission, we will develop tools to support those solutions, but if there are other platforms and tools that already exist out there for a given application, we encourage our educators to use these in innovative ways in combination with the FutureLearn platform. Our platform offers flexibility for both educators and learners whilst still maintaining a strong pedagogical approach, which means the platform can be used on its own, or in combination with other tools and face-to-face learning, to create the best social learning experiences.<\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/neil.jpeg\"><img loading=\"lazy\" class=\"wp-image-63955 size-full aligncenter\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/neil.jpeg\" alt=\"neil\" width=\"360\" height=\"640\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/neil.jpeg 360w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/neil-169x300.jpeg 169w\" sizes=\"(max-width: 360px) 100vw, 360px\" \/><\/a><br \/>\n<em>Neil Harvey hosting a panel on FutureLearn and the role of MOOCs in education.<\/em><\/p>\n<p><strong>Yishay Mor<\/strong><\/p>\n<p>You see that every year at BETT. There are a lot of LMS, usually from small players because the big brands don&#8217;t see much value in being there. My main issue is that you don&#8217;t know how to judge them: it&#8217;s hard to evaluate which LMS is worth following.<\/p>\n<p>Is there enough space in the market? At the end of the day, there are a few of them that are good in all departments, have a huge developer team, are open source, and which galvanize a community. All these other smaller players have to work very hard to convince me to look at their solutions; especially when compared to Canvas, Moodle, or ILIAS, who all have big teams.<\/p>\n<p>There are already so many solid options on the market, so why should I listen to what you have to offer as a LMS builder?<\/p>\n<p>No, I believe the gap isn’t in LMS but in education design — how to embed learning culture in organizations. Many organizations are still content with WordPress, and don&#8217;t feel they need a LMS. And those who buy a LMS solution often follow a trend [of which LMS is most popular], but if you don&#8217;t know what learning experience you want to provide, no technical solution will save you. As an illustration, we can see several LMSs that are focused on problem-based, project-based, or case-based learning, but very few people know how to design courses for that type of pedagogy.<\/p>\n<p>This is why I tell people &#8220;you need UX (user experience), LX (learning experience) and TX (teacher experience), the rest will follow.&#8221; The LMS give you the UX and, for some of them, the analytics (which can be a game changer for improving the learner experience), but the rest is up to you to provide.<\/p>\n<p><strong>Laia Albó<\/strong><\/p>\n<p>I think the smaller players have it very difficult for competing with already established LMSs, such as Canvas, Moodle, and so on. Returning to the MOOCs, although some LMS support that type of course, I think it would be interesting to explore technological solutions to somehow facilitate the integration of courses that are hosted in MOOC platforms within LMSs used by universities. However, I think LMSs have to learn from MOOC platforms in terms of their success in putting the user experience and content at the highest layer; but MOOC platforms also have lessons to learn from traditional LMSs, especially regarding collaborative learning and learning analytics related with teacher experience, in order to provide information of what’s happening during the course at all levels and at any time.<span class=\"cc-blockquote-border\"><br \/>\n<\/span><\/p>\n<p><strong>Susanna Sancassani<\/strong><\/p>\n<p>The real problem about LMSs is that the rapid evolution of the ICT context doesn’t give proprietary LMSs a lot of chance to stay up-to-date, nor to provide a significant “plus” at a reasonable cost: open source platforms are always very competitive. The reasonable space for business in LMSs is more service-related (hosting, personalization, help desk, and process tutoring) than in the software itself, and there is still a large margin for evolution in this aspect.<span class=\"cc-blockquote-border\"><br \/>\n<\/span><br \/>\n<a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2.jpg\"><img class=\"wp-image-63944\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2-1024x690.jpg\" alt=\"yoniitslearning2\" width=\"100%\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2-1024x690.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2-300x202.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2-768x518.jpg 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2-85x58.jpg 85w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2016\/08\/yoniitslearning2.jpg 1061w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a> Yours truly at the &#8220;It&#8217;s Learning&#8221; booth — one of the many LMS providers present at BETT.<\/p>\n<p><strong>Will Woods<br \/>\n<\/strong><\/p>\n<p>BETT had a variety of smaller LMS vendors, as well as one or two of the larger LMS providers. However, I don’t think anyone in higher education would consider this the correct environment for making decisions about LMS. Schools and universities are much more savvy now about what makes a LMS suitable for their organization, because the technologies are much more mature. It is healthy to review LMS policy regularly — every couple of years — to track which of the LMS vendors are innovating and which are stalling. I believe that the discussion should be more around when to consider a multi-platform approach, and also about the balance between in-house bespoke and off-the-shelf cloud supported environments. What will be critical in the future for LMS vendors and clients is how well they support predictive analytics and learning analytics, to enable educators to take an evidence-based approach to supporting their learners.<\/p>\n<p><em><strong>About the author:<\/strong> Yoni Dayan is an entrepreneur in edtech and a teaching assistant for Stanford and NovoEd (<a href=\"https:\/\/novoed.com\/venture1-2016-2\">Technology Entrepreneurship course<\/a>). For five years he has been designing and updating online programs, creating and engaging learning communities, and experimenting on new ways to learn (social learning, VR\/AR, etc.). Follow him on <a href=\"https:\/\/twitter.com\/yonidayan_\">Twitter<\/a>.<br \/>\n<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yoni Dayan catches up with several experts in the EdTech space. In this first part of a series, he asks them about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.<\/p>\n","protected":false},"author":24,"featured_media":63896,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[639,8],"tags":[43],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What European Leaders in EdTech Think of the State of MOOCs: Part I — Class Central<\/title>\n<meta name=\"description\" content=\"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What European Leaders in EdTech Think of the State of MOOCs: Part I\" \/>\n<meta property=\"og:description\" content=\"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2016-09-15T04:55:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2018-10-03T16:15:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Yoni Dayan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/\",\"name\":\"What European Leaders in EdTech Think of the State of MOOCs: Part I — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#primaryimage\"},\"datePublished\":\"2016-09-15T04:55:21+00:00\",\"dateModified\":\"2018-10-03T16:15:29+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/ee42a8a8ea9e88d684e38b0144fd8920\"},\"description\":\"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"What European Leaders in EdTech Think of the State of MOOCs: Part I\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/ee42a8a8ea9e88d684e38b0144fd8920\",\"name\":\"Yoni Dayan\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/d5a58edd0b078ae613b6cc41b57c1c97?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/d5a58edd0b078ae613b6cc41b57c1c97?s=96&d=mm&r=g\",\"caption\":\"Yoni Dayan\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/yoni-dayan\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"What European Leaders in EdTech Think of the State of MOOCs: Part I — Class Central","description":"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/","og_locale":"en_US","og_type":"article","og_title":"What European Leaders in EdTech Think of the State of MOOCs: Part I","og_description":"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.","og_url":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2016-09-15T04:55:21+00:00","article_modified_time":"2018-10-03T16:15:29+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/11\/the-report-meta.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Yoni Dayan","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#primaryimage","inLanguage":"en-US","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#webpage","url":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/","name":"What European Leaders in EdTech Think of the State of MOOCs: Part I — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#primaryimage"},"datePublished":"2016-09-15T04:55:21+00:00","dateModified":"2018-10-03T16:15:29+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/ee42a8a8ea9e88d684e38b0144fd8920"},"description":"In this first part of a series, we asks several european leaders about where MOOCs have settled within EdTech, and the ongoing Learning Management System fever.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/european-leaders-edtech-think-state-moocs-part-1\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"What European Leaders in EdTech Think of the State of MOOCs: Part I"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/ee42a8a8ea9e88d684e38b0144fd8920","name":"Yoni Dayan","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/d5a58edd0b078ae613b6cc41b57c1c97?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/d5a58edd0b078ae613b6cc41b57c1c97?s=96&d=mm&r=g","caption":"Yoni Dayan"},"url":"https:\/\/www.classcentral.com\/report\/author\/yoni-dayan\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/64112"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=64112"}],"version-history":[{"count":17,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/64112\/revisions"}],"predecessor-version":[{"id":64362,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/64112\/revisions\/64362"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/63896"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=64112"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=64112"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=64112"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}