{"id":69324,"date":"2019-09-23T15:07:53","date_gmt":"2019-09-23T22:07:53","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=69324"},"modified":"2019-11-23T13:48:13","modified_gmt":"2019-11-23T21:48:13","slug":"in-depth-review-elements-of-ai","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/","title":{"rendered":"In-Depth Review: Elements of AI"},"content":{"rendered":"<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\"><img loading=\"lazy\" class=\"alignnone wp-image-69325 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\" alt=\"Elements of AI screenshot\" width=\"1509\" height=\"924\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg 1509w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3-300x184.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3-768x470.jpg 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3-1024x627.jpg 1024w\" sizes=\"(max-width: 1509px) 100vw, 1509px\" \/><\/a><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/independent-elements-of-ai-12469\"><span style=\"font-weight: 400;\">Elements of AI<\/span><\/a><span style=\"font-weight: 400;\"> (Artificial Intelligence) is offered in English, Finnish, and Swedish by the University of Helsinki.<\/span><\/p>\n<h2><b>An Extract From the Course Blurb<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">“The goal of this course is to demystify AI<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The elements of AI is a free online course for everyone interested in learning what AI is, what is possible (and not possible) with AI, and how it affects our lives – with no complicated mathematics or programming required. By completing the course you can earn a free downloadable certificate. People in Finland can also earn 2 ECTS credits through <\/span><span style=\"font-weight: 400;\">[<\/span><a href=\"https:\/\/www.helsinki.fi\/en\/open-university\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Finland’s] Open University<\/span><\/a><span style=\"font-weight: 400;\">. This is a real university course with actual credits.”<\/span><\/p>\n<h2><b>Course Design<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The overall and weekly course objectives are stated clearly, much more clearly than many other courses I have explored.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">“After taking the course, you will be able to:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Understand some of the major implications of AI.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Think critically about AI news and claims.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Define and discuss what AI is.<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Explain the methods that make AI possible.”<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The course was released on May 14, 2018. It is arranged in six modules or chapters, with a recommended time commitment of five to ten hours per module. Students could sign up for the scheduled six weeks with weekly reminder emails, or a self-paced option. I signed up for the self-paced option because I expected to finish the course more quickly than six weeks. I wondered if I would have difficulty accessing later chapters early if I signed up for the six-week version.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Ten days later I finished the course. Each chapter generally took me about three hours,<\/span><span style=\"font-weight: 400;\"> but I am a fairly fast reader. <\/span><span style=\"font-weight: 400;\">The course has lots of reading, including extra links to other pages. There are no videos. Each chapter’s material consists of three pages, but they are long pages full of comprehensive information.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When I did the course in 2018, the discussions through <\/span><a href=\"https:\/\/spectrum.chat\/elementsofai\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Spectrum<\/span><\/a><span style=\"font-weight: 400;\"> were dynamic, with a bit of a feel of the old Coursera discussions. Although student numbers and comments are fewer now, the discussions have not completely dried up.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You have to create an account with Spectrum using Facebook, Google, Twitter or GitHub.<\/span><\/p>\n<h2><b>Assessment<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">25 exercises (assessments) are distributed throughout the course, rather than having quizzes at the end of each week. The pass mark is 50% (or perhaps 60% if you want credit towards a degree. One information page said 60%, several others said 50%, so this point was not clear). You also have to complete at least 90% of the exercises. Some are multiple choice. You only get one chance, compared to Coursera’s unlimited tries until you get it right. Some are calculations, where students have to input the correct number. There were plenty of comments in the forums from students who input the right answer formatted incorrectly and were thus marked wrong. This issue seems to have been addressed by course staff, who made the answer checker either slightly more forgiving, or by clarifying in the instructions exactly what format the answer should take.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Five of the exercises are short essay\/paragraph answers, peer-reviewed. Peer review answers are supposed to be “more than a few sentences” but no word limit is specified. I wrote about 200-300 words for each.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Some of these require research before and after deciding what topic to write about. For some of the peer review exercises, I had to go back to previous course pages. I also searched other sites to help clarify my thoughts and choose my topic before actually writing my answers. After submitting the answers, a sample answer appears. Students are also required to review three other students’ answers before receiving their own result. The review process is quite simple, with five faces ranging from very sad to very happy for each of four criteria:<\/span><\/p>\n<ul>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Answer is comprehensive<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Answer is well reasoned<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Answer is easy to follow<\/span><\/li>\n<li><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Answer is on-topic<\/span><\/li>\n<\/ul>\n<h2><b>Grading<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Because comments are not required for assessments, the assessment process is generally quick, although it can be frustrating to receive a sad face and not understand what was wrong with your answer. On the other hand, reading each sample answer and other students’ answers provided insight into the topics researched.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">There is a warning about plagiarism before the first peer assessment and students can mark suspect answers as spam for course staff to check.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Staff at Uni of Helsinki manually go through those answers that don’t receive pass marks by the peers, and reset the field if necessary so the students can have another go at answering them.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Non-peer-reviewed exercises are allowed only one attempt. The automatic system grades the answer and provides an explanation, whether it was right or wrong. It’s unforgiving, so it really pays to take care. Try to use other resources to check your answer before submitting it. Even though the course pages explain the processes, often when trying to work out the examples, many students, including me, need to try a few approaches before fully understanding how to solve the problem. Having a practice or two before answering the questions would have been invaluable. Perhaps having the practice exercises on individual course pages, then weekly test questions might help here. Some students were particularly unhappy with the labelling, believing that “exercises” are practice questions, not assessments.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A few exercises have been either deleted or reset to not count towards the final result because they were vague, ambiguous, or had errors in the problem statement. It is obvious from reading some of the earlier comments in the forums that several other questions have been tweaked after receiving feedback from students.<\/span><\/p>\n<h2><b>A Problem With Reviews<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Apart from the issues of correct answers being marked wrong because of incorrect formatting, there seemed to be a problem with some students’ first peer assessment. I submitted my answer around July 21, then completed my compulsory three assessments of other students’ work. I continued with the course, but the first peer assessment exercise continued to say “pending peer review”.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">From forum comments, some other students had the same problem, with advice from course staff generally being, “Give it time, let us know if it is still not reviewed after a few weeks.” Eventually, a staff comment mentioned that some learners submitted an answer, but apparently had no interest or understanding of reviewing others. This caused a backlog in answers being reviewed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I finished the remainder of the course, including the other four peer assessed answers which all came back with pass marks within 24 hours of me completing my own reviews of others’ answers. I passed the course and received my certificate even without the first peer review. Some other students were still waiting on their reviews to see if they had passed or not.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">A few weeks later, my assignment was finally reviewed, which boosted my result by a few marks.<\/span><\/p>\n<h2><b>Course Provider<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">The course was created by Reaktor and the University of Helsinki. The lead instructor is Associate Professor <\/span><a href=\"https:\/\/www.cs.helsinki.fi\/u\/ttonteri\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Teemu Roos<\/span><\/a><span style=\"font-weight: 400;\"> who has been quite active answering questions in the course forums, mainly questions regarding certificates and course mechanics rather than content questions. He continued answering forum queries during his summer break in June &amp; July 2018. A year on, he is less active in the discussion forums, but still replies to questions from time to time.<\/span><\/p>\n<p><b>The Course Chapter by Chapter<\/b><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 1 What is AI?<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Chapter 1 discusses concepts of autonomy and adaptivity as used in AI. It also helps us distinguish between realistic and unrealistic AI uses and some philosophical problems related to AI. The first peer-reviewed exercise is on the third page of chapter 1.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 2 AI problem solving<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Some uses of AI are described here, particularly for solving puzzles and learning how to win games. I got all six parts of exercise 6 wrong because we had to work it out using a diagram. I drew up the diagram but didn’t notice that the example starter diagram had actually put two boxes in a different order from my diagram. This made all my ensuing boxes incorrect. If I had taken more care with how I actually drew my diagram and how well it agreed with the example, I would have been okay.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 3 Real world AI<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Probabilities and Bayesian reasoning are introduced here. Although to a mathematician probability &amp; percentages are very basic concepts, I can imagine some people getting confused here, even though the calculations are explained quite clearly. It’s handy if you have a calculator and think carefully about the information.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I was confused by Page 3 of this section, which discussed a spam-filtering application. I took my time going back over the work and looking at the suggested resources, and still got two of the exercises wrong. Doing the exercises without practice was tricky. There was no chance to try a few problems and work out HOW to work them out. After your attempt, they were explained clearly, but if you started off thinking the wrong way, you got the answer wrong with no chance of having another go to get it right. I was overthinking some of the answers, when the answer was already sitting there in front of me, but thinking I had to do a more complicated calculation.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 4 Machine Learning<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The why and how of machine learning are described here, including unsupervised and supervised machine learning scenarios. Chapter 4 also explains how filter bubbles work, particularly to target advertising according to people’s online behaviour.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 5 Neural networks<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The what, where, and how of neural networks are explained here. The brain is an example of a biological neural network, although we are still far from understanding or artificially copying its complexity.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">·<\/span><span style=\"font-weight: 400;\">   <\/span> <span style=\"font-weight: 400;\">Chapter 6 Implications<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Don’t think you’re almost done when you get to the sixth chapter. There are three peer reviewed short essay questions in this chapter.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The difficulty of predicting future uses and implications of AI are discussed here, including privacy issues.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You will find plenty of further reading links on the last (summary) page, including a recommendation to look out for the upcoming University of Helsinki AI programming MOOC in early 2019. Many students announced in the discussion forum that they are planning to go on to <\/span><a href=\"https:\/\/www.classcentral.com\/course\/coursera-machine-learning-835\"><span style=\"font-weight: 400;\">Andrew Ng’s Machine Learning course<\/span><\/a><span style=\"font-weight: 400;\"> on Coursera or similar courses.<\/span><\/p>\n<h2><b>ECTS Credits Available<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Finnish students who earn a certificate receive 2 ECTS credits towards their degree. (60 credits is equivalent to one year of full-time study.) <\/span><span style=\"font-weight: 400;\">Students outside Finland or enrolled at other universities can apply for credit with the help of<\/span> <a href=\"https:\/\/www.cs.helsinki.fi\/u\/ttonteri\/elements\/elements_objectives.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">this PDF<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><span style=\"font-weight: 400;\"> It lists the syllabus and learning objectives, assessment methods, time requirements and study credit information<\/span><span style=\"font-weight: 400;\">.<\/span><\/p>\n<p><i><span style=\"font-weight: 400;\">Revised version of an article<\/span><\/i><i><span style=\"font-weight: 400;\"> first published at<\/span><\/i><em> <a href=\"http:\/\/onlinelearningsuccess.org\/elements-of-ai-review-course\/\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-weight: 400;\">Online Learning Success<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.<\/p>\n","protected":false},"author":72,"featured_media":69325,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[178],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>In-Depth Review: Elements of AI — Class Central<\/title>\n<meta name=\"description\" content=\"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"In-Depth Review: Elements of AI\" \/>\n<meta property=\"og:description\" content=\"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2019-09-23T22:07:53+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-11-23T21:48:13+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1509\" \/>\n\t<meta property=\"og:image:height\" content=\"924\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pat Bowden\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg\",\"width\":1509,\"height\":924,\"caption\":\"Elements of AI screenshot\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/\",\"name\":\"In-Depth Review: Elements of AI — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#primaryimage\"},\"datePublished\":\"2019-09-23T22:07:53+00:00\",\"dateModified\":\"2019-11-23T21:48:13+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2\"},\"description\":\"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"In-Depth Review: Elements of AI\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2\",\"name\":\"Pat Bowden\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g\",\"caption\":\"Pat Bowden\"},\"description\":\"Online learning specialist, still learning after 100+ MOOCs completed since 2012. Class Central customer support and help since 2018. I am keen to help others make the most of online learning, so I set up a website:  www.onlinelearningsuccess.org\",\"sameAs\":[\"http:\/\/www.onlinelearningsuccess.org\"],\"url\":\"https:\/\/www.classcentral.com\/report\/author\/pat-bowden\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"In-Depth Review: Elements of AI — Class Central","description":"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/","og_locale":"en_US","og_type":"article","og_title":"In-Depth Review: Elements of AI","og_description":"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.","og_url":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2019-09-23T22:07:53+00:00","article_modified_time":"2019-11-23T21:48:13+00:00","og_image":[{"width":1509,"height":924,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Pat Bowden","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2019\/08\/ElementsOfAIImage3.jpg","width":1509,"height":924,"caption":"Elements of AI screenshot"},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#webpage","url":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/","name":"In-Depth Review: Elements of AI — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#primaryimage"},"datePublished":"2019-09-23T22:07:53+00:00","dateModified":"2019-11-23T21:48:13+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2"},"description":"A free online course that introduces students to Artificial Intelligence, how it works and where it is used in today’s world.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/in-depth-review-elements-of-ai\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"In-Depth Review: Elements of AI"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2","name":"Pat Bowden","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g","caption":"Pat Bowden"},"description":"Online learning specialist, still learning after 100+ MOOCs completed since 2012. Class Central customer support and help since 2018. I am keen to help others make the most of online learning, so I set up a website:  www.onlinelearningsuccess.org","sameAs":["http:\/\/www.onlinelearningsuccess.org"],"url":"https:\/\/www.classcentral.com\/report\/author\/pat-bowden\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/69324"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/72"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=69324"}],"version-history":[{"count":9,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/69324\/revisions"}],"predecessor-version":[{"id":69715,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/69324\/revisions\/69715"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/69325"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=69324"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=69324"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=69324"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}