{"id":75169,"date":"2021-04-21T21:43:18","date_gmt":"2021-04-22T04:43:18","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=75169"},"modified":"2021-04-28T12:26:54","modified_gmt":"2021-04-28T19:26:54","slug":"most-popular-may-2021","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/","title":{"rendered":"35 Most Popular Online Courses Starting in May 2021"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-75278\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" alt=\"Most Popular Courses\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-300x150.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-768x384.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>Here are the thirty-five most popular free online university courses and <a href=\"https:\/\/www.classcentral.com\/help\/moocs\/\">Massive Open Online Courses<\/a> (MOOCS) starting in May 2021, based on Class Central learners’ activity.<\/p>\n<p>You can find the entire catalog of 30,000 online courses offered by close to 1000 universities around the world on <a href=\"https:\/\/www.classcentral.com\/subjects\">Class Central’s subject page<\/a>.<\/p>\n<p>If these courses don’t interest you, either browse our extensive catalog of <a href=\"https:\/\/www.classcentral.com\/subjects\">30,000 online courses<\/a> or have a look at our thematic collections:<\/p>\n<ul>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/free-certificates\/\">Massive List of Thousands of Free Certificates and Badges<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/coursera-free-online-courses\/\">1600+ Coursera Courses That Are Still Completely Free<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/ivy-league-moocs\">450+ Free Ivy League Online Courses<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/top-free-online-courses\">The Best Online Courses of All-Time<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/udemy-top-courses\/\">250 Top Udemy Courses of All Time<\/a><\/li>\n<\/ul>\n<p>To see all our compilations, visit <a href=\"https:\/\/www.classcentral.com\/collections\">Class Central’s Collections<\/a>.<\/p>\n<h2>Most Popular Online Courses Starting in May<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/motivation-engagement-in-an-uncertain-world-stand-35771\"><b>Motivation and Engagement in an Uncertain World<\/b><\/a><br \/>\n<i>Coventry University via FutureLearn<\/i><br \/>\nSupporting you during the coronavirus outbreak.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/leadership-and-organizational-behavior-39296\"><b>Leadership and organizational behavior<\/b><\/a><br \/>\n<i>Tecnológico de Monterrey via Coursera<\/i><br \/>\nIn this class, you will learn the foundations of psychology at work, so that you can better understand others and guide them to shared goals.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/excel-power-tools-35045\"><b>Excel Power Tools for Data Analysis<\/b><\/a><br \/>\n<i>Macquarie University via Coursera<\/i><br \/>\nIn this four-week course, we introduce Power Query, Power Pivot and Power BI, three power tools for transforming, analysing and presenting data. In this course, we will learn how to use Power Query to automate the process of importing and preparing data for analysis.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/launch-online-business-39285\"><b>Launch Your Online Business<\/b><\/a><br \/>\n<i>State University of New York via Coursera<\/i><br \/>\nLearners who complete the course will:<br \/>\n&#8211; gain an understanding of different business models<br \/>\n&#8211; learn strategies for naming their business<br \/>\n&#8211; create customer personas<br \/>\n&#8211; and more<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/critical-thinking-reasoned-decision-making-39290\"><b>Critical thinking: reasoned decision making<\/b><\/a><br \/>\n<i>Tecnológico de Monterrey via Coursera<\/i><br \/>\nIn this course of critical thinking the students will learn the tendencies, approximations and assumptions on which their reflections are based, and the conditions and the outcomes derived from their ways of thinking. This reflective thought is the active, careful and persistent examination of all beliefs in the light of the fundamentals that support them and their conclusions.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-software-defined-networking-37602\"><b>Introduction to Software Defined Networking<\/b><\/a><br \/>\n<i>Curtin University via edX<br \/>\n<\/i>Learn and apply practical skills in Software Defined Networking for IoT applications.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/database-design-postgresql-37623\"><b>Database Design and Basic SQL in PostgreSQL<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nIn this course you will learn more about the historical design of databases and the use of SQL in the PostgreSQL environment. Using SQL techniques and common commands (INSERT INTO, WHERE, ORDER BY, ON DELETE CASCADE, etc) will enable you to create tables, column types and define the schema of your data in PostgreSQL.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/korean-for-beginners-part-1-37634\"><b>Korean for Beginners: Step 1<\/b><\/a><br \/>\n<i>Saint Petersburg State University via Coursera<\/i><br \/>\nIn our course, you will be able to not only master Korean on an elementary level, but also gain the necessary knowledge about the Korean culture and traditions, which is crucial in learning the language. Once you have mastered the basic Korean language course, you will be able to communicate directly with your Korean peers, better understand the mentality of Koreans, and make a lot of friends in Korea.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-deep-learning-2-33404\"><b>Introduction to Deep Learning<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Learn how deep learning algorithms can be used to solve important engineering problems.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/suffering-and-the-human-condition-35096\"><b>Suffering and the Human Condition<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nSuffering is an inevitable yet poorly understood feature of human existence. This course examines how societies respond to the puzzling reality of human anguish.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/companies-and-climate-change-37051\"><b>Companies and climate change<\/b><\/a><br \/>\n<i>ESSEC Business School via Coursera<\/i><br \/>\nThis MOOC will not be a technical MOOC, this MOOC will not be an advocacy MOOC either, this MOOC will be a pedagogical object that will help you have a better understanding of organizational issues and managerial concepts in relation to climate change &#8211; a complex scientific topic. It is therefore a question of knowing more about how a company can take climate change into account in its strategy and its operations.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/cloud-computing-foundations-duke-37670\"><b>Cloud Computing Foundations<\/b><\/a><br \/>\n<i>Duke University via Coursera<\/i><br \/>\nIn this course, you will learn how to build foundational Cloud computing infrastructure, including websites involving serverless technology and virtual machines. You will also learn how to apply Agile software development techniques to projects which will be useful in building portfolio projects and global-scale Cloud infrastructures.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/edx-stand-up-comedy-writing-and-performance-poetry-21290\"><b>Stand Up!; Comedy Writing and Performance Poetry<\/b><\/a><br \/>\n<i>University of Cambridge via edX<br \/>\n<\/i>Prepare to perform your comic writing and\/or poetry to a live audience, as well as develop transferable writing skills and communication expertise that will be relevant in any profession. This course will broaden your understanding how to structure a stand-up comedy set, as well as allow you to understand how to use narrative form in your performance poetry texts. You will also reflect on the ways in which you might enhance the quality of your writing practice by being a performer yourself.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/javascript-basics-36577\"><b>JavaScript Basics<\/b><\/a><br \/>\n<i>University of California, Davis via Coursera<\/i><br \/>\nThis course introduces the programming language JavaScript and shows the websites that include the type of interactions students will eventually be able to develop. Learners will understand the importance of how JavaScript was developed and why such history impacts the way JavaScript is currently written and in future releases.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/plant-based-diets-food-for-a-sustainable-future-34336\"><b>Plant Based Diets: Food for a Sustainable Future<\/b><\/a><br \/>\n<i>Wageningen University via edX<br \/>\n<\/i><span lang=\"EN-US\">When you hear of the enormous global challenges we face, don’t you wish you could actually do something about it? Well, you can! Grab an apple as we explore the science behind Plant Based Diets and discover the impact you can have, by simply ‘going (more) plant based’.<\/span><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/iot-networking-37700\"><b>IoT Networking<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nThis course builds on the first two courses in this series: IoT Devices and IoT Communications. Here you will begin to learn enterprise IoT. Enterprise networks, from first-hop access to backend IoT services are critical because they allow your IoT devices to reach the Internet and achieve their true intelligence.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/advanced-models-for-decision-making-39412\"><b>Advanced Models for Decision Making<\/b><\/a><br \/>\n<i>University of Minnesota via Coursera<\/i><br \/>\nThis course is designed to connect data and models to real world decision-making scenarios in manufacturing, supply chain, finance, human resource management, etc. In particular, we understand how linear optimization &#8211; a prescriptive analytics method &#8211; can be used to formulate decision problems and provide data-based optimal solutions.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/database-architecture-scale-nosql-elasticsearch-p-37625\"><b>Database Architecture, Scale, and NoSQL with Elasticsearch<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nYou’ll learn to use Elasticsearch NoSQL, which is a common NoSQL database and a supplement to a relational database to high-speed search and indexing. We will examine Elasticsearch as an example of a BASE-style (Basic Availability, Soft State, Eventual Consistency) database approach, as well as compare and contrast the advantages and challenges associated with ACID and BASE databases.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/challenges-of-modern-caregiving-35097\"><b>The Challenges of Modern Caregiving<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course examines how the organization of care has changed in modern times and the dilemmas those developments pose to helping professionals. Among the questions it engages are: How does the meaning of care change when it is performed outside the family?<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/optimization-for-decision-making-39410\"><b>Optimization for Decision Making<\/b><\/a><br \/>\n<i>University of Minnesota via Coursera<\/i><br \/>\nThis course will introduce students to the basic principles of linear optimization for decision-making. Using practical examples, this course teaches how to convert a problem scenario into a mathematical model that can be solved to get the best business outcome. We will learn to identify decision variables, objective function, and constraints of a problem, and use them to formulate and solve an optimization problem using Excel solver and spreadsheet.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/political-geography-35126\"><b>Political Geography<\/b><\/a><br \/>\n<i>Moscow State Institute of International Relations (MGIMO) via Coursera<\/i><br \/>\nPolitical geography is a discipline concerned with the spatial dimensions of politics. This course is an introduction to the study of political science, international relations and area studies, providing a systemic approach to the spatial dimension of political processes at all levels.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/ethical-issues-data-science-37621\"><b>Ethical Issues in Data Science<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course examines some of the ethical issues related to data science, with the fundamental objective of making data science professionals aware of and sensitive to ethical considerations that may arise in their careers. It does this through a combination of discussion of ethical frameworks, examination of a variety of data science applications that lead to ethical considerations, reading current media and scholarly articles, and drawing upon the perspectives and experiences of fellow students and computing professionals.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/hypertension-program-35140\"><b>Fundamentals for Implementing a Hypertension Program<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nThis course provides the fundamental knowledge necessary for program managers and implementors in a hypertension control program, especially in resource-limited settings. The course is interactive and includes useful tips relevant to different settings. The course should be also relevant to physicians, nurses, pharmacists, community health workers, and others who are interested in learning about hypertension diagnosis and management.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/sports-injury-prevention-37580\"><b>Sports Injury Prevention<\/b><\/a><br \/>\n<i>Waseda University via edX<br \/>\n<\/i>Learn to cut the risk of sports injury through a combined scientific and practical approach<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/communication-for-engineering-leaders-34204\"><b>Communication for Engineering Leaders<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Talented engineers will find helpful guidance and dedicated space for practicing skills necessary for more effective communication with teammates, clients, and employees and\/or pursuing the next level of leadership opportunities.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/korean-beginners-35056\"><b>A Bridge to the World: Korean Language for Beginners Ⅰ<\/b><\/a><br \/>\n<i>Sungkyunkwan University via Coursera<\/i><br \/>\nThis course is an introductory course to Korean language that aims to cultivate basic communication skill for those that are interested in learning Korean language.<br \/>\nThe course is composed of essential expressions that are often used in everyday life, and designed to teach grammars using basic dialogues which reflect colloquial characteristics of Korean language so by end of this course, a student will be able to express him\/herself on ordinary topics.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/elastic-buckling-and-behavior-of-members-35081\"><b>Elastic Stability and Behavior of Members<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Learn elastic stability concepts including methods to evaluate stability including bifurcation method and energy methods. Learn the differential equations governing behavior of structural members, and use them for column buckling analysis<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/patient-perspectives-on-medications-qualitative-i-36579\"><b>Patient Perspectives on Medications: Qualitative Interviews<\/b><\/a><br \/>\n<i>University of Copenhagen via Coursera<\/i><br \/>\nThis course teaches you how to explore the patient perspective on medicines using qualitative interviews. You will learn how to design, conduct and analyse data in a small interview study. The course is related to the course Understanding Patient Perspectives on Medications, but each course can be taken separately.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/artificial-intelligence-in-bioinformatics-40231\"><b>Artificial Intelligence in Bioinformatics<\/b><\/a><br \/>\n<i>Taipei Medical University via FutureLearn<\/i><br \/>\nDiscover the future of bioinformatics and learn how AI models of bioinformatics data help us to understand biological processes.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/inclusive-growth-39402\"><b>Inclusive Growth<\/b><\/a><br \/>\n<i>International Monetary Fund via edX<br \/>\n<\/i>Learn how to achieve strong, sustainable, green, and inclusive growth.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/an-anthropology-of-smartphones-39404\"><b>An Anthropology of Smartphones: Communication, Ageing and Health<\/b><\/a><br \/>\n<i>University College London via FutureLearn<\/i><br \/>\nExplore how smartphones have affected our lives by using comparative anthropology as a method of research.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/the-fundamental-of-data-driven-investment-39288\"><b>The Fundamental of Data-Driven Investment<\/b><\/a><br \/>\n<i>Sungkyunkwan University via Coursera<\/i><br \/>\nIn this course, the instructor will discuss the fundamental analysis of investment using R programming. The course will cover investment analysis topics, but at the same time, make you practice it using R programming. This course&#8217;s focus is to train you to do the elemental analysis for investment management that you might need to do in your job every day.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/sustainable-energy-access-for-communities-39306\"><b>Sustainable Energy Access for Communities<\/b><\/a><br \/>\n<i>University College London via FutureLearn<\/i><br \/>\nLearn the techniques to help communities move towards a renewable energy future and apply them to make changes in your community.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/invitation-to-ex-noguchi-room-e-37615\"><b>Invitation to Ex-Noguchi Room: Preservation and Utilization of Cultural Properties in Universities<\/b><\/a><br \/>\n<i>Keio University via FutureLearn<\/i><br \/>\nLearn how to preserve, restore and utilize cultural properties in universities—a case study from Keio University, Tokyo.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/plastics-in-infrastructure-and-the-environment-32157\"><b>Plastics in Infrastructure and the Environment<\/b><\/a><br \/>\n<i>Purdue University via edX<br \/>\n<\/i>Through this course, students will gain an appreciation of the complexity of issues surrounding polymers in civil and environmental engineering.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The thirty-five most popular free online university courses and MOOCS starting in May 2021.<\/p>\n","protected":false},"author":1,"featured_media":75278,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[94],"tags":[500],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>35 Most Popular Online Courses Starting in May 2021 — Class Central<\/title>\n<meta name=\"description\" content=\"The thirty-five most popular free online university courses and MOOCS starting in May 2021.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"35 Most Popular Online Courses Starting in May 2021\" \/>\n<meta property=\"og:description\" content=\"The thirty-five most popular free online university courses and MOOCS starting in May 2021.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2021-04-22T04:43:18+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-28T19:26:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@dhawalhshah\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dhawal Shah\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"width\":1024,\"height\":512,\"caption\":\"Most Popular Courses\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/\",\"name\":\"35 Most Popular Online Courses Starting in May 2021 — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#primaryimage\"},\"datePublished\":\"2021-04-22T04:43:18+00:00\",\"dateModified\":\"2021-04-28T19:26:54+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\"},\"description\":\"The thirty-five most popular free online university courses and MOOCS starting in May 2021.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"35 Most Popular Online Courses Starting in May 2021\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e\",\"name\":\"Dhawal Shah\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png\",\"caption\":\"Dhawal Shah\"},\"description\":\"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.\",\"sameAs\":[\"https:\/\/www.classcentral.com\/\",\"https:\/\/twitter.com\/dhawalhshah\"],\"url\":\"https:\/\/www.classcentral.com\/report\/author\/dhawal\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"35 Most Popular Online Courses Starting in May 2021 — Class Central","description":"The thirty-five most popular free online university courses and MOOCS starting in May 2021.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/","og_locale":"en_US","og_type":"article","og_title":"35 Most Popular Online Courses Starting in May 2021","og_description":"The thirty-five most popular free online university courses and MOOCS starting in May 2021.","og_url":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2021-04-22T04:43:18+00:00","article_modified_time":"2021-04-28T19:26:54+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","twitter_creator":"@dhawalhshah","twitter_site":"@classcentral","twitter_misc":{"Written by":"Dhawal Shah","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","width":1024,"height":512,"caption":"Most Popular Courses"},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#webpage","url":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/","name":"35 Most Popular Online Courses Starting in May 2021 — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#primaryimage"},"datePublished":"2021-04-22T04:43:18+00:00","dateModified":"2021-04-28T19:26:54+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e"},"description":"The thirty-five most popular free online university courses and MOOCS starting in May 2021.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/most-popular-may-2021\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"35 Most Popular Online Courses Starting in May 2021"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/e922d025b9a3a5844fe50b6960f5325e","name":"Dhawal Shah","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2020\/03\/dhawal-shah-150x150.png","caption":"Dhawal Shah"},"description":"Dhawal is the CEO of Class Central, the most popular search engine and review site for online courses and MOOCs. He has completed over a dozen MOOCs and has written over 200 articles about the MOOC space, including contributions to TechCrunch, EdSurge, Quartz, and VentureBeat.","sameAs":["https:\/\/www.classcentral.com\/","https:\/\/twitter.com\/dhawalhshah"],"url":"https:\/\/www.classcentral.com\/report\/author\/dhawal\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75169"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=75169"}],"version-history":[{"count":5,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75169\/revisions"}],"predecessor-version":[{"id":75285,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/75169\/revisions\/75285"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/75278"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=75169"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=75169"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=75169"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}