{"id":76352,"date":"2022-07-13T06:00:39","date_gmt":"2022-07-13T13:00:39","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=76352"},"modified":"2022-07-13T13:51:13","modified_gmt":"2022-07-13T20:51:13","slug":"review-google-it-pro-certificate","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/","title":{"rendered":"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization?"},"content":{"rendered":"<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-06PatBowden-google-it-certificate.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-78309\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-06PatBowden-google-it-certificate.jpg\" alt=\"Pat Bowden Google Support Professional Certificate\" width=\"1000\" height=\"773\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-06PatBowden-google-it-certificate.jpg 1000w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-06PatBowden-google-it-certificate-300x232.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-06PatBowden-google-it-certificate-768x594.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/a><\/p>\n<p><strong id=\"verdict\">TL;DR<\/strong>: Simply presenting a prospective employer with a certificate is not the same as being a capable IT Support person. You will need to learn the material (and yes, plenty of material is covered in these five six-week courses), be prepared to research, particularly for recent developments, and practice at every opportunity, so solving a wide range of IT issues becomes second nature. I passed all the courses and earned the Professional Certificate, but because I didn’t commit much material to memory and did little hands-on practice, I don’t feel ready to take on a job in IT Support. Is working hard on the Professional Certificate enough to do so? The several Google employees who feature in the courses are enthusiastic in their view that with hard work, you can break into an entry-level IT support role after completing this Professional Certificate.<\/p>\n<h2>Why I Took This Specialization<\/h2>\n<p>Information about the <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">Google IT Support Professional Certificate<\/a> tells learners “This is your path to a career in IT. In this program, you’ll learn in-demand skills that will have you job-ready in less than 6 months. No degree or experience required.”<\/p>\n<p>As a female on the wrong side of 60, I am definitely not a stereotypical computer geek. Although I have worked with computers for many years, it has mostly been specific work after training in those particular tasks. More recently, though, I have done a little <a href=\"https:\/\/www.classcentral.com\/report\/programming-course-comparison\/\">Python programming<\/a> and a few short <a href=\"https:\/\/www.classcentral.com\/help\/moocs\">online courses<\/a> on <a href=\"https:\/\/www.classcentral.com\/@pat\">various aspects of computers<\/a>.<\/p>\n<p>So, can a tech dinosaur learn the knowledge to become an IT support person after taking a Coursera Specialization?<\/p>\n<p>I earned certificates in the five courses in <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">the Specialization<\/a>, which led to a Coursera Professional certificate and another certificate and badge from Credly. I also have the option to take the <a href=\"https:\/\/www.comptia.org\/certifications\/a\">CompTIA A+ certification exams<\/a> and earn a dual badge.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-11CourseraCredlyGoogleITSupportCertificate.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-78310\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-11CourseraCredlyGoogleITSupportCertificate.jpg\" alt=\"Google IT Support Certificate Issued by Coursera\/Credly\" width=\"823\" height=\"638\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-11CourseraCredlyGoogleITSupportCertificate.jpg 823w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-11CourseraCredlyGoogleITSupportCertificate-300x233.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/02\/2022-01-11CourseraCredlyGoogleITSupportCertificate-768x595.jpg 768w\" sizes=\"(max-width: 823px) 100vw, 823px\" \/><\/a><\/p>\n<p>But I won’t be attempting the exam. While tackling the courses, I realized that getting a certificate and actually knowing the work well enough to take on an IT support role are very different things.<\/p>\n<h2>Time Commitment<\/h2>\n<p>When I checked the information at the start, I quickly noticed conflicting messages about the time commitment for the Specialization. The <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">information page<\/a> says 10 hours per week for 6 months.<\/p>\n<p>In the first video of the first course, we hear: &#8220;If you dedicate around eight to 10 hours a week to the courses, we anticipate that you&#8217;ll complete the certificate in about eight months.&#8221;<\/p>\n<p>Then a bit later in the first week, there is a &#8220;Set yourself up for success&#8221; form where you can choose your commitment from 3 choices:<\/p>\n<ul>\n<li aria-level=\"1\">around 7 hours per week (about 1 hour per day) for up to 3 months.<\/li>\n<li aria-level=\"1\">around 3 1\/2 to 7 hours per week (about 1\/2 to 1 hour per day) for 3 to 6 months.<\/li>\n<li aria-level=\"1\">around 3 1\/2 hours per week (about 1\/2 hour per day) for 6 months or longer.<\/li>\n<\/ul>\n<p>Quite a range! Between 7 hours per week for 3 months (about 90 hours) and 10 hours a week for 8 months (about 380 hours).<\/p>\n<p>Maybe, though, the range allows for different levels of prior knowledge. An absolute beginner would likely take much longer going through the course than someone who has been tinkering with computers and dealing with IT issues in their spare time for a few years. An absolute beginner might need to re-watch videos and explore the readings carefully to fully grasp the material.<\/p>\n<p>And that was my experience. As I worked through the courses, I found I was familiar with some material, but was a complete newbie in other topics. I could power through some videos at 1.5 speed, while I had to re-watch others and re-read the transcripts to understand and absorb the information. And I’ll have to admit that partway through, I decided to go for understanding enough to pass the assessments, rather than the thorough learning needed to prepare for a career. Happy in my current career, I am not looking for a change.<\/p>\n<p>While I haven&#8217;t looked into job availability and the chances of landing a job in IT support after taking this Specialization, I can assure you that the five courses of six weeks duration each are packed with loads of information. They also look at various aspects of job seeking such as hints for writing applications and going to interviews.<\/p>\n<h2>Hints for Success<\/h2>\n<ul>\n<li aria-level=\"1\">Take the time to learn the definitions and acronyms: DNS, DHCP, TFTP, PXE etc. There are plenty! Make flashcards. Make lists, both in alphabetical order and grouped into categories such as networking, security, etc. The more times you add an acronym and its meaning to a list, the more likely you are to remember its meaning. You will come across some of them time and time again as you progress through the courses.<\/li>\n<li aria-level=\"1\">Make lists of Linux &amp; Windows Powershell commands. Even if your future role doesn’t involve these, creating the lists will help you understand and learn the basics.<\/li>\n<li aria-level=\"1\">Learners are reminded several times throughout the courses that part of an IT Support role is to keep your knowledge up to date, and to read and research relevant topics frequently. Links to many readings are provided. Read these and take notes to round out your knowledge. If you’re unsure about anything, remember Google and other search engines are your friends. But remember that not all websites are trustworthy!<\/li>\n<li aria-level=\"1\">While most of the material can be accessed on a mobile device, you will need a computer to complete some assessment items. If you don’t own one, think about how you can borrow or hire one for the assessments. Having access to a computer will also be useful for applying some of your new knowledge.<\/li>\n<\/ul>\n<h2>Overview<\/h2>\n<p>The <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">Google IT Support Professional Certificate<\/a> was launched in January 2018. It is very popular, with more than 800k enrollments by early 2022. The first course has earned a place in the top 20 of Class Central’s <a href=\"https:\/\/www.classcentral.com\/report\/most-popular-online-courses\/\">Most Popular Courses of All Time<\/a> list. Some people have just enrolled in single courses rather than the specialization, with &gt;940k enrollments for the first course (<a href=\"https:\/\/www.classcentral.com\/course\/technical-support-fundamentals-10220\">Technical Support Fundamentals<\/a>). More than 200k have enrolled in the last (<a href=\"https:\/\/www.classcentral.com\/course\/it-security-10218\">IT Security: Defense Against the Digital Dark Arts<\/a>). These large numbers lead to a steady flow of comments in discussion steps of the courses.<\/p>\n<p>As well as teaching IT Support issues, videos throughout the Professional Certificate feature various aspects of the job-search market including interviewing, dealing with rejections, and what to include in your resume. Several Google employees speak about how they ended up in their current job. Many started their computer experience either tinkering with computers at home, volunteering their IT skills at non-profit organizations or part-time work during their student days, although some came into the IT sector more recently.<\/p>\n<p>The Specialization is very directed towards job-seekers, with strong encouragement and “You can do it!” enthusiasm throughout.<\/p>\n<p>The courses include videos, readings, discussion prompts, practice quizzes and a range of graded items. Some graded items are multiple-choice quizzes, some are practical exercises, and some ask for written answers. Grading and assessments are mentioned in more detail in the course recaps below.<\/p>\n<p><a href=\"https:\/\/www.qwiklabs.com\/\">Qwiklabs<\/a> is a virtual machine environment, linked via Coursera, that allows learners to practice many applications without needing to download software to their own machine. <a href=\"https:\/\/www.eweek.com\/cloud\/google-acquires-qwiklabs-to-teach-hands-on-cloud-building\/\">Owned by Google<\/a>, Qwiklabs can be rather buggy and frustrating, but really helpful to practice and learn various aspects of IT. One drawback &#8211; the number of times you can access each exercise is limited. Although I never ran out of attempts, some other learners mentioned their frustration in the discussion forums. Course mentors directed them to Qwiklabs Support for assistance. Some Qwiklabs activities were graded assessments, others were practice exercises.<\/p>\n<p>Many aspects of IT are covered in the courses. Learn to set up and maintain single devices and networks. Troubleshoot common hardware and software issues. Explore security, encryption, centralized management, plus many more components of IT. I am likely to revisit some of the videos in the future whenever I come up against any issues.<\/p>\n<h2><b>Reviews of the Individual Courses<\/b><\/h2>\n<p>Click on a course name to jump to the review:<\/p>\n<ul>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#course1\">Course 1: Technical Support Fundamentals<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#course2\">Course 2: The Bits and Bytes of Computer Networking<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#course3\">Course 3: Operating Systems and You: Becoming a Power User<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#course4\">Course 4: System Administration and IT Infrastructure Services<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#course5\">Course 5: IT Security: Defense Against the Digital Dark Arts<\/a><\/li>\n<\/ul>\n<h1 id=\"course1\">Course 1: Technical Support Fundamentals<\/h1>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/technical-support-fundamentals-10220\">The course<\/a> is definitely what it claims to be: an introduction to computers from the very basics, aimed at learners who want to break into the IT support field. I was impressed that the course started out assuming learners know virtually nothing about how computers work. In this respect, I discovered I know more about computers than I thought. I went through most of the videos at 1.5 speed and easily passed the quizzes. This six-week course took me about two to three hours per “week” and I crammed the whole course into eight days. This might not be the best way to learn, and although I understood the material, I’m unlikely to recall it all a few months down the track. Nevertheless, a few aspects stood out.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-76357\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\" alt=\"Inside a computer\" width=\"903\" height=\"520\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png 903w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer-300x173.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer-768x442.png 768w\" sizes=\"(max-width: 903px) 100vw, 903px\" \/><\/a><\/p>\n<p>I was skeptical of the claim we’ll “build a computer in course one,” but, true to their word, the Google presenter (<span aria-hidden=\"true\">Devan Sri-Tharan<\/span>) first displayed and identified the parts inside a computer, then demonstrated building a computer from the motherboard up. Safety issues were addressed, alongside how to select and handle the various components. Although I did not attempt to build a computer, the week’s assessment included an interactive exercise. Learners had to identify the components and place them in the correct positions with the mouse. I had some trouble making the components fall into place with the mouse, but later selected Keyboard Usage and found it much easier to navigate the plugin with a combination of keyboard selections and mouse clicks.<\/p>\n<h2>Some Earlier Issues Now Resolved<\/h2>\n<p>Some older reviews on Class Central complained about issues using Quiklabs in Weeks 3 and 5. Happily, these bugs appear to have been ironed out, as I had no problems taking the assessments. I found, though, that after completing the exercises, I had to refresh my Coursera page for the result to appear.<\/p>\n<p>If you are a mobile user, some assessments require a computer and cannot be completed on a mobile device. You will need to consider how to access a computer for these. If you are auditing the course, this is not an issue.<\/p>\n<p>The peer assessment mentioned in older reviews is no longer included.<\/p>\n<p>In Week 2, several errors in speech were “fixed” by saying “Oops! We meant to say &#8230;” as an errata where the video is stopped. This is more usually for an in-video question. Be aware that if you download the videos with the mobile app to watch offline, you may miss these errata messages. On the other hand, the transcript progresses on the app as the video plays.<\/p>\n<h2>Active Forums<\/h2>\n<p>Several steps asked for comments in the discussion forum. I found the forums active, with several new comments within the last day or so. Enrollment numbers are constantly growing in this popular Specialization.<\/p>\n<p>Specialist Google employees presented the various topics in course one. Hardware, operating systems, software, networking, and troubleshooting, including empathy were all covered.<\/p>\n<p>Would you expect to need empathy when working as an IT support person? The use of empathy is explained thoroughly in Week 6 because often IT support is called when users are frustrated and irritated. Putting yourself in their shoes helps you understand their feelings and often helps them calm down. They can then explain what’s happening more clearly as you help solve the issue.<\/p>\n<p>Overall, the course appears to fulfill its stated goal – to begin preparing learners for a job in the IT support field. There are even several videos discussing job applications and interview techniques.<\/p>\n<p>I look forward to continuing the Specialization to increase my knowledge and find out how ready I might be for a job in IT Support.<\/p>\n<h1 id=\"course2\">Course 2: The Bits and Bytes of Computer Networking<\/h1>\n<p>After steaming through <a href=\"https:\/\/www.classcentral.com\/course\/technical-support-fundamentals-10220\">the first course<\/a> in just over a week, I did not get back to the Google IT Professional Certificate for a month. Work and family life intervened, then when I finally started again, it took several days of effort to complete the first week’s material.<\/p>\n<p>The second course in the Google IT Support Professional Certificate is called <a href=\"https:\/\/www.classcentral.com\/course\/computer-networking-10222\">The Bits and Bytes of Computer Networking<\/a> which delves into how computers communicate with each other. Networking is much more than simply connecting up a bunch of devices with wifi or ethernet cords. I discovered a world of TCP\/IP layers, packet headers, ports, and sockets.<\/p>\n<p>Early in the course, one of my colleagues asked if the course was practical or theoretical. I said “theoretical” then later realized it is more practical. Some background information is provided, but the course is firmly oriented towards locating and resolving networking issues.<\/p>\n<p>As in the first course in the Specialization, I found differing time estimates, maybe due to differences in prior knowledge.<\/p>\n<table>\n<tbody>\n<tr>\n<td>Source<\/td>\n<td>Time estimate (hours)<\/td>\n<\/tr>\n<tr>\n<td>Class Central<\/td>\n<td>33<\/td>\n<\/tr>\n<tr>\n<td>Coursera<\/td>\n<td>34<\/td>\n<\/tr>\n<tr>\n<td>Course info page (after signing up)<\/td>\n<td>48 &#8211; 60<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>It can be harder to learn something if your previous concept of the material is wrong. I had this issue in a small way when I thought about nodes. I think of a node as a junction (such as a node on a tree where branches sprout) and it took me a while to realize that a computer node can be a device with just one connection to the network.<\/p>\n<figure id=\"attachment_76721\" aria-describedby=\"caption-attachment-76721\" style=\"width: 1619px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree.jpg\"><img loading=\"lazy\" class=\"size-full wp-image-76721\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree.jpg\" alt=\"\" width=\"1619\" height=\"796\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree.jpg 1619w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree-300x147.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree-1024x503.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree-768x378.jpg 768w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-04NodesOnATree-1536x755.jpg 1536w\" sizes=\"(max-width: 1619px) 100vw, 1619px\" \/><\/a><figcaption id=\"caption-attachment-76721\" class=\"wp-caption-text\">Nodes on the trunk of a tree<\/figcaption><\/figure>\n<figure id=\"attachment_76722\" aria-describedby=\"caption-attachment-76722\" style=\"width: 936px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-20NodesOnANetwork.png\"><img loading=\"lazy\" class=\"size-full wp-image-76722\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-20NodesOnANetwork.png\" alt=\"\" width=\"936\" height=\"528\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-20NodesOnANetwork.png 936w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-20NodesOnANetwork-300x169.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-20NodesOnANetwork-768x433.png 768w\" sizes=\"(max-width: 936px) 100vw, 936px\" \/><\/a><figcaption id=\"caption-attachment-76722\" class=\"wp-caption-text\">Nodes on a computer network.<\/figcaption><\/figure>\n<p>I finally passed the Week 1 graded assessment. After launching into the second week, I was scared by the words “Warning: dense material ahead,” in the video about Subnet Masks. At the time, I didn’t really know why Subnet Masks should be so hard to understand, but I liked the way the instructor (Victor Escobedo) took the time to tell us that we may need to re-watch the video a few times and think carefully about what he’s presenting. Considering I had already spent more time than planned going through Week 1, I wasn’t sure what to expect. Anyway, I started by simply watching the video without taking any notes. Next, I read through the transcript, then watched the video a second time, pausing it and taking notes as I went. I then decided to read the transcript for each of the following videos before watching them. As usual, when I had trouble understanding something, I replayed the relevant part of the video over again.<\/p>\n<p>After all this, I passed the second weekly quiz without difficulty. Will I remember the material in the future? Time will tell.<\/p>\n<h2>Losing Momentum<\/h2>\n<p>I lost momentum again during the third week, especially when faced with an essay question at the end of the week. Like in the first course, this may have originally been a peer-reviewed exercise, but no longer needs to be reviewed by other learners.<\/p>\n<p>One recurring phrase throughout the courses is “… as an IT support specialist …” For example, “As an IT Support Specialist, you&#8217;ll often have to help troubleshoot networking or connectivity issues for end users.” This reminds learners of why we need to understand certain concepts and processes, and how to fix issues. In fact, the phrase “IT support specialist” appears 18 times during this course, according to Coursera’s new <a href=\"https:\/\/www.classcentral.com\/report\/coursera-search-within-course\/\">Search<\/a> feature. These regular mentions are helpful reminders of the end goal: to break into the IT support field.<\/p>\n<p>And maybe that was part of the problem. I am taking this Specialization to see if it’s possible to learn enough to become an IT Support person, not because I have a burning ambition to enter the field. That being said, I still want to complete the Specialization.<\/p>\n<p>After completing Week 3, I spent a few days procrastinating: playing video games, calling my mother, mindlessly browsing social media…<\/p>\n<figure id=\"attachment_76723\" aria-describedby=\"caption-attachment-76723\" style=\"width: 876px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-19BitsAndBytesOfNetworkingScreenshot.png\"><img loading=\"lazy\" class=\"size-full wp-image-76723\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-19BitsAndBytesOfNetworkingScreenshot.png\" alt=\"\" width=\"876\" height=\"510\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-19BitsAndBytesOfNetworkingScreenshot.png 876w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-19BitsAndBytesOfNetworkingScreenshot-300x175.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-19BitsAndBytesOfNetworkingScreenshot-768x447.png 768w\" sizes=\"(max-width: 876px) 100vw, 876px\" \/><\/a><figcaption id=\"caption-attachment-76723\" class=\"wp-caption-text\">Presenter Victor Escobedo<\/figcaption><\/figure>\n<h2>Regaining Focus<\/h2>\n<p>I eventually decided it was time to set a <a href=\"http:\/\/onlinelearningsuccess.org\/learningsuccesswithapomodoro\/\">Pomodoro<\/a> to help me focus. As things turned out, I didn’t need to resort to the Pomodoro. I returned to Coursera and managed to get through Week 4. And the beautiful thing was, what I had found numbingly boring in earlier weeks started to make sense. I still found it slower going than the first course, but pushing through and taking time to understand the previous weeks was worth the effort.<\/p>\n<p>Continuing with the same strategy of reading the transcript then watching the video and taking notes (pausing and repeating as necessary), I also made it through weeks 5 and 6.<\/p>\n<h2>Strategies for Challenging Courses<\/h2>\n<ul>\n<li> Take the time to understand and become familiar with the material<\/li>\n<li> Read the transcripts and watch the videos as many times as necessary<\/li>\n<li> Take notes<\/li>\n<li> Use flash cards to memorize points<\/li>\n<li> If motivation is an issue, set up a Pomodoro<\/li>\n<li> Remind yourself why you are doing the course and what the benefit will be when you complete it<\/li>\n<\/ul>\n<p>This course covered a lot of material. For me, with scarcely any prior knowledge of networking, it was heavy going. I took plenty of notes along the way. Even doing the course this way, I have probably not taken much into long-term memory, but at least I understood enough to exceed the 80% pass mark. Although I passed all the assessments, I still feel woefully ignorant about the details covered in this course. If I seriously wanted to become an IT support person, I would benefit from re-doing the course, re-watching the videos, carefully examining the readings, and committing more to memory.<\/p>\n<p>A video at the very end of the course showed a “job interview” with some examples of questions an IT support person may be asked about networking and how to answer them. This illuminating video was another reminder of the end goal of getting a job in the field.<\/p>\n<h1 id=\"course3\">Course 3: Operating Systems and You: Becoming a Power User<\/h1>\n<p>After the struggles of Networking, I turned with relief to the third course in the <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">Google IT Support Professional Certificate<\/a>: <a href=\"https:\/\/www.classcentral.com\/course\/os-power-user-10221\">Operating Systems and You: Becoming a Power User<\/a>. And, overall, I found this course easier, although some frustrations popped up along the way.<\/p>\n<p>Windows and Linux operating systems are covered in the course, with a video explaining each particular process for Windows, followed by a Linux video. My notes ended up as a jumbled mass of Windows and Linux processes.<\/p>\n<p>Mobile systems are also touched on; they appear to be occasional additional videos added after the course was released. They are not mentioned in the quizzes or graded assessments.<\/p>\n<p>Many aspects of operating systems are discussed in the six-week schedule. The modules are Navigating the System, Users and Permissions, Package and Software Management, Filesystems, Process Management, and Operating Systems in Practice.<\/p>\n<p>As a computer user, I found the course interesting and relevant. The discussion of passwords and the importance of selecting secure passwords was excellent. We are also taught how to deal with removable devices such as USB drives. We also learned plenty of processes involving installing, maintaining, and deleting packages including dealing with corrupted files, on both the GUI (graphical user interface) and the CLI (command line interpreter). Other topics include how to reset a machine and why it’s best to only do this as a last resort, and user permissions, which will be particularly useful if you are in IT support for a business with several, or even hundreds of employees.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-11-06UsingLinuxCommandPrompt.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-76850\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-11-06UsingLinuxCommandPrompt.png\" alt=\"Instructor Cindy Quach with a screenshot of a Linux command\" width=\"943\" height=\"528\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-11-06UsingLinuxCommandPrompt.png 943w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-11-06UsingLinuxCommandPrompt-300x168.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-11-06UsingLinuxCommandPrompt-768x430.png 768w\" sizes=\"(max-width: 943px) 100vw, 943px\" \/><\/a><\/p>\n<p>Cindy Quach, the instructor, covered a lot of material in the course, yet by the end I found myself wanting more. She explained some material clearly, yet at other times, she quickly typed a command, saying, “You can see (blah blah blah)” without expanding the explanation. Every module included readings from Wikipedia, Microsoft, Linux, or other resources. Learners are regularly reminded that research and self-education are intrinsic parts of being an IT support person. In other words, don’t just rely on passing the courses to prepare you for a job in the field.<\/p>\n<h2>Assessment<\/h2>\n<p>Unlike the previous two courses in this <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">Professional Certificate Specialization<\/a>, all the assessments (behind the paywall) are taken on the Qwiklabs virtual machine. You will need access to a computer or laptop for the graded assessments – the virtual machine can’t be accessed on mobile. Each week also has ungraded practice quizzes available to learners auditing the course. The practice quizzes are an aid to learning the material covered during the week, and more questions would have been welcome.<\/p>\n<p>But by far the most frustrating aspect is the Qwiklabs virtual machine used for the graded assessments. Many, many forum comments criticize the Qwiklabs format and performance. While some issues appear to have been resolved a year or more ago, others continue to plague the platform.<\/p>\n<p>Issues include:<\/p>\n<ul>\n<li>Timed sessions combined with slow load times can lead to running out of time to complete assessments. While some weeks’ assessments only took about 10 minutes, others could take longer than the hour allotted and you may need to re-attempt it<\/li>\n<li>Several assessments consisted of simply copying the commands provided in Qwiklabs. But even though you can use the Copy link provided, it’s impossible to paste the text into Qwiklabs. So, you have to type it out manually. And some of the commands are ridiculously long for manual typing! For example, just one line of one of the answers is this: <em>$FILE = $GET_HTML.Links | Select-Object @{Label=&#8217;href&#8217;;Expression={@{$true=$_.href}[$_.href.EndsWith(&#8216;win64.exe&#8217;)]}} | Select-Object -ExpandProperty href<\/em><br \/>\nThe assessment thus becomes a test of how well you can copy the given answers, rather than properly understanding them and working out the answers for yourself<\/li>\n<li>If your screen is small, you might find it beneficial to copy the answers and paste them into Notepad or similar so you can more easily see the spaces and characters. Like many computer-related tasks, any tiny error such as missing a space, or text in the wrong case, means the answer is incorrect<\/li>\n<li>Most labs consisted of two to five tasks. Each task was explained, then learners had to click a Check My Progress button after completion. In week six, the assessment explained one of the five parts, then effectively said, “Here are the other tasks which you covered in previous weeks, now do them,” without explaining how to make sure your completed tasks were credited. No visible Check My Progress button; for this lab you had to click the orange score at the top right for a pop-out to appear with the Check My Progress buttons in it. I eventually discovered this when I re-read the instructions. And from comments in the discussion forums, I wasn’t the only one to miss this detail. Why not have the tasks and buttons listed as per all of the previous weeks? Just one more stress while doing a timed assessment.<\/li>\n<\/ul>\n<p>The assessments seemed to be such divergent standards: some consisted of copying commands without full understanding and others needed to be worked out without sufficient explanation.<\/p>\n<p>My advice to learners: write down all the commands or save them in files. Look up more commands in the recommended reading materials and any other resources you can find. Practice the commands as Cindy does them. Practice them again after the videos and before attempting the graded items. If you can&#8217;t open Windows Powershell or Linux on your device, consider how you can access a computer so you can become familiar with the material before attempting the assessments.<\/p>\n<h2>Conclusion<\/h2>\n<p>This was definitely a course that could have included much more material and explanations. But then again, as a prospective IT support person, perhaps it’s up to me to explore and learn more Windows Powershell and Linux commands. Although I passed the course with full marks, I definitely don’t feel ready to tackle all of these issues in the workplace. As Cindy said in the introductory video: “But remember, you&#8217;ll need to practice, practice, and practice some more to get a firm grip on operating systems.”<\/p>\n<h1 id=\"course4\">Course 4:  System Administration and IT Infrastructure Services<\/h1>\n<p>Throughout the <a href=\"https:\/\/www.classcentral.com\/course\/google-it-support-18565\">Specialization<\/a>, we are often reminded that jobs in IT Support can be found in both small and large businesses. You may be the sole IT Support person, responsible for everything from hardware breakdowns to user lockouts and networking issues. Or you may work in an IT team, with individuals responsible for particular facets of support.<\/p>\n<p>Course Two looked at networking and Course Three’s focus was on operating systems. Devan Sri-Tharan combines these in the <a href=\"https:\/\/www.classcentral.com\/course\/system-administration-it-infrastructure--10219\">fourth course<\/a> so you can learn about organizing user access into groups, automation, and scaling up processes for larger sites.<\/p>\n<p>At the end of course, Devan says, “Hard work pays off.” It’s unfortunate that having put the hard work into producing the courses that make up this Professional Certificate, Google and Coursera did not see fit to put some serious work into effectively addressing ongoing issues.<\/p>\n<p>Qwiklabs continued to spark discussion and complaints in the forum and it looks like they gave up on trying to fix the issues in these labs. I was able to complete most exercises, but they are no longer graded. You don’t even have to attempt the lab to score 100%, which is 0.01% of your score for the course. The grade is awarded when you click <em>Okay!<\/em> to unlock the lab exercise. You then just have to open the tool in the next item to complete the step.<\/p>\n<p>But you are doing yourself a disservice if you don’t attempt the labs. I found them challenging and a great learning tool.<\/p>\n<p>As in the first and second courses, one item is a written answer, which is likely to have previously been a peer-assessed assignment. Early in 2021, I wrote about <a href=\"https:\/\/www.classcentral.com\/report\/peer-grading-problems\/\">problems with peer assessments<\/a>. It appears that instead of addressing issues with peer assessments, Coursera and Google have decided to water them down and award full marks to everyone who submits an answer. In Course one, it was ungraded. Course two awarded 10% for your attempt. This time, the “Quiz” is worth around 25% of your marks. Three scenarios are presented, and learners are asked to suggest five courses of action for each. I was astonished to find that although the question says you need to write 200 &#8211; 400 words for each scenario, this is not enforced. If peer assessments are not suitable, would it be possible to design an autograder that looks for minimum and maximum word count, and perhaps includes particular keywords?<\/p>\n<p>If you want to work in IT support, make sure you consider the questions carefully and answer thoroughly. You may encounter similar scenarios in the workplace.<\/p>\n<figure id=\"attachment_77491\" aria-describedby=\"caption-attachment-77491\" style=\"width: 925px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-12-17Course4Grades.png\"><img loading=\"lazy\" class=\"wp-image-77491 size-full\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-12-17Course4Grades.png\" alt=\"\" width=\"925\" height=\"853\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-12-17Course4Grades.png 925w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-12-17Course4Grades-300x277.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2021-12-17Course4Grades-768x708.png 768w\" sizes=\"(max-width: 925px) 100vw, 925px\" \/><\/a><figcaption id=\"caption-attachment-77491\" class=\"wp-caption-text\">My assignments and grades<\/figcaption><\/figure>\n<p>There was another sign of Google’s lack of attention to detail after going through the trouble of creating this Professional Certificate Specialization. When I completed this course, I received the usual “Congratulations” email, which included a broken (error 404) link to <a href=\"https:\/\/www.classcentral.com\/course\/it-automation-10217\">IT Automation: It’s not that scary!<\/a> This course was originally part of the Specialization, but in May 2018 was dropped from the schedule.<\/p>\n<p>Two days later, I received another email from Coursera which included a link to the correct course: <a href=\"https:\/\/www.classcentral.com\/course\/it-security-10218\">IT Security: Defense against the digital dark arts<\/a>.<\/p>\n<p>Despite these criticisms, the course itself was informative and included plenty of useful details.<\/p>\n<h1 id=\"course5\">Course 5: IT Security: Defense against the digital dark arts<\/h1>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02EAP.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-78303\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02EAP.png\" alt=\"Instructor Gian Spicuzza\" width=\"950\" height=\"538\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02EAP.png 950w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02EAP-300x170.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02EAP-768x435.png 768w\" sizes=\"(max-width: 950px) 100vw, 950px\" \/><\/a><\/p>\n<p>In the <a href=\"https:\/\/www.classcentral.com\/course\/it-security-10218\">final course<\/a> of the series, we are re-introduced to Gian Spicuzza, Program Manager in Android Security at Google, who covered History of the Internet &amp; the Internet of Things in Course One. I had been looking forward to learning more about security, but found myself in a race against the clock.<\/p>\n<p>A year ago, I paid for an annual <a href=\"https:\/\/www.classcentral.com\/report\/coursera-plus-launch\/\">Coursera Plus<\/a> subscription. By the time I was ready to start the final course, I had little over a week before my subscription ran out &#8211; which meant that to access the graded items, I would either need to work quickly or pay more. Skinflint that I am, I chose to rush through the course and earn my certificate before the graded items were locked.<\/p>\n<figure id=\"attachment_78304\" aria-describedby=\"caption-attachment-78304\" style=\"width: 941px\" class=\"wp-caption alignnone\"><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-12Course5Grades.jpg\"><img loading=\"lazy\" class=\"size-full wp-image-78304\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-12Course5Grades.jpg\" alt=\"\" width=\"941\" height=\"820\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-12Course5Grades.jpg 941w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-12Course5Grades-300x261.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-12Course5Grades-768x669.jpg 768w\" sizes=\"(max-width: 941px) 100vw, 941px\" \/><\/a><figcaption id=\"caption-attachment-78304\" class=\"wp-caption-text\">My Coursera Plus subscription had run out when I took this screenshot.<\/figcaption><\/figure>\n<p>Assessments were a mix of quiz questions, Qwiklabs exercises, and finished with a long essay question worth 8%. The Qwiklabs worked smoothly for me in this course. As always, the quiz questions were challenging and required some thought and recall of work covered in the relevant topics. Re-attempted quizzes included some different questions. And, as in other courses, the final case-study essay question appeared to previously be a peer assessed assignment. Again, take the time to research security needs and solutions fully and answer this question carefully. It will consolidate your understanding of setting up and maintaining a business computer network.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02OAuth.png\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-78305\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02OAuth.png\" alt=\"OAuth authentification\" width=\"950\" height=\"538\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02OAuth.png 950w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02OAuth-300x170.png 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/11\/2022-01-02OAuth-768x435.png 768w\" sizes=\"(max-width: 950px) 100vw, 950px\" \/><\/a><\/p>\n<p>I finished the course with a pass mark, but my poor brain didn’t retain much of the material. I’m planning to revisit the videos again, to learn more about security issues, authentication, cryptology, hashing, and more.<\/p>\n<h2>Update Six Months Later:<\/h2>\n<p>After a few months break, I decided to revisit the final course so I could give it more attention than I had the first time around. I started with the introductory video.<\/p>\n<p>Immediately, I noticed something that I’d previously skimmed over: the videos for this Professional Certificate were released in 2018. The introductory video mentions the “recent” <a href=\"https:\/\/en.wikipedia.org\/wiki\/WannaCry_ransomware_attack\">WannaCry<\/a> cryptoworm and the <a href=\"https:\/\/en.wikipedia.org\/wiki\/Mirai_(malware)\">Mirai<\/a> botnet, which date from 2017 and 2016 respectively. I looked through the readings for each week of the course, but more recent attacks were not mentioned.<\/p>\n<p>In the ever-changing world of internet security, why not include annual updates of security threats? They would help the course feel fresher and more current. A page of Readings would not take too much time to update annually.<\/p>\n<p>The first week details many different types of malicious attacks and tricks that scammers use to trick users into letting malware into their systems. It’s scary stuff! The second week discusses cryptography, including symmetric and asymmetric encryption, hashing, and Public Key Infrastructure including digital certificates. Week three covers Authentication, Authorization, and Accounting. Network security is covered in the fourth week, followed in the final two weeks by network hardening, firewalls, assessing risk, and setting up a disaster recovery plan.<\/p>\n<p>The course ends with links to a range of resources to help you enter the job market and an invitation to join Google’s <a href=\"https:\/\/googlecerts.biginterview.com\/\">Big Interview<\/a> for free so you can practice answering interview questions and prepare to get that job in IT Support. Some resources are only available for learners in the US.<\/p>\n<p>Not only does the Google IT Professional Certificate offer learners plenty of information about becoming an IT support person, it maintains an upbeat “You can do it!” attitude throughout and includes various resources to help you get a job after you finish. But don’t be fooled into thinking you will become instantly employable when you add the certificate to your resume. You need to know the work and prove to prospective employers that you can do it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a female on the wrong side of 60, I&#8217;m not a stereotypical computer geek. Could I become job-ready in less than 6 months?<\/p>\n","protected":false},"author":72,"featured_media":76357,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[178],"tags":[677],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization? — Class Central<\/title>\n<meta name=\"description\" content=\"As a female on the wrong side of 60, I&#039;m not a stereotypical computer geek. Could I become job-ready in less than 6 months?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization?\" \/>\n<meta property=\"og:description\" content=\"As a female on the wrong side of 60, I&#039;m not a stereotypical computer geek. Could I become job-ready in less than 6 months?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2022-07-13T13:00:39+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-07-13T20:51:13+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\" \/>\n\t<meta property=\"og:image:width\" content=\"903\" \/>\n\t<meta property=\"og:image:height\" content=\"520\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pat Bowden\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"24 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png\",\"width\":903,\"height\":520,\"caption\":\"Inside a computer\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/\",\"name\":\"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization? — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#primaryimage\"},\"datePublished\":\"2022-07-13T13:00:39+00:00\",\"dateModified\":\"2022-07-13T20:51:13+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2\"},\"description\":\"As a female on the wrong side of 60, I'm not a stereotypical computer geek. Could I become job-ready in less than 6 months?\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2\",\"name\":\"Pat Bowden\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g\",\"caption\":\"Pat Bowden\"},\"description\":\"Online learning specialist, still learning after 100+ MOOCs completed since 2012. Class Central customer support and help since 2018. I am keen to help others make the most of online learning, so I set up a website:  www.onlinelearningsuccess.org\",\"sameAs\":[\"http:\/\/www.onlinelearningsuccess.org\"],\"url\":\"https:\/\/www.classcentral.com\/report\/author\/pat-bowden\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization? — Class Central","description":"As a female on the wrong side of 60, I'm not a stereotypical computer geek. Could I become job-ready in less than 6 months?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/","og_locale":"en_US","og_type":"article","og_title":"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization?","og_description":"As a female on the wrong side of 60, I'm not a stereotypical computer geek. Could I become job-ready in less than 6 months?","og_url":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2022-07-13T13:00:39+00:00","article_modified_time":"2022-07-13T20:51:13+00:00","og_image":[{"width":903,"height":520,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png","type":"image\/png"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Pat Bowden","Est. reading time":"24 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/09\/2021-09-03LookingInsideAComputer.png","width":903,"height":520,"caption":"Inside a computer"},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#webpage","url":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/","name":"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization? — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#primaryimage"},"datePublished":"2022-07-13T13:00:39+00:00","dateModified":"2022-07-13T20:51:13+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2"},"description":"As a female on the wrong side of 60, I'm not a stereotypical computer geek. Could I become job-ready in less than 6 months?","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/review-google-it-pro-certificate\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"Can a Tech Dinosaur Become a Google IT Support Person After Taking a Coursera Specialization?"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/61428e4d541efa0ab624c1139607efc2","name":"Pat Bowden","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/3794cbeb72e1711c404595eb7dea9c31?s=96&d=mm&r=g","caption":"Pat Bowden"},"description":"Online learning specialist, still learning after 100+ MOOCs completed since 2012. Class Central customer support and help since 2018. I am keen to help others make the most of online learning, so I set up a website:  www.onlinelearningsuccess.org","sameAs":["http:\/\/www.onlinelearningsuccess.org"],"url":"https:\/\/www.classcentral.com\/report\/author\/pat-bowden\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/76352"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/72"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=76352"}],"version-history":[{"count":37,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/76352\/revisions"}],"predecessor-version":[{"id":81038,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/76352\/revisions\/81038"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/76357"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=76352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=76352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=76352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}