{"id":78589,"date":"2022-02-21T00:45:47","date_gmt":"2022-02-21T08:45:47","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=78589"},"modified":"2022-09-22T00:31:36","modified_gmt":"2022-09-22T07:31:36","slug":"most-popular-march-2022","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/","title":{"rendered":"35 Most Popular Online Courses Starting in March 2022"},"content":{"rendered":"<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-75278\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" alt=\"Most Popular Courses\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-300x150.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-768x384.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n<p>Here are the 35 most popular free online university courses and <a href=\"https:\/\/www.classcentral.com\/help\/moocs\/\">Massive Open Online Courses<\/a> (MOOCs) starting in March 2022, based on Class Central learners’ activity.<\/p>\n<p>If these courses don’t interest you, either browse Class Central’s extensive catalog of 50,000 online courses via our <a href=\"https:\/\/www.classcentral.com\/subjects\">subjects page<\/a>, or have a look at our <a href=\"https:\/\/www.classcentral.com\/collections\">thematic collections<\/a>:<\/p>\n<ul>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/free-certificates\/\">Massive List of Thousands of Free Certificates and Badges<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/coursera-free-online-courses\/\">1600+ Coursera Courses That Are Still Completely Free<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/ivy-league-moocs\">450+ Free Ivy League Online Courses<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/top-free-online-courses\">The Best Online Courses of All Time<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/edx-top-courses\/\">100 Top FREE edX Courses of All Time<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/udemy-top-courses\/\">250 Top Udemy Courses of All Time<\/a><\/li>\n<\/ul>\n<p>To see all our compilations, visit <a href=\"https:\/\/www.classcentral.com\/collections\">Class Central Collections<\/a>.<\/p>\n<h2>Most Popular Courses<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/computer-applications-of-artificial-intelligence--52912\"><b>Computer Applications of Artificial Intelligence and e-Construction<\/b><\/a><br \/>\n<i>Purdue University via edX<\/i><br \/>\nLearn the fundamentals of artificial intelligence, machine learning, natural language processing and their applications in e-Construction.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/principles-of-management-60072\"><b>Principles of Management<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nHow do you form, launch, and manage a team such that it has the highest chance of success? How can you ensure your team’s work aligns with the organization’s strategy? What basic project management tools can you utilize right away, without purchasing special software, that will help your team meet its objectives on time, on budget, and to spec? This course will help you succeed in your career.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/emotional-intelligence-cultivating-immensely-huma-62883\"><b>Emotional Intelligence: Cultivating Immensely Human Interactions<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nThis course is a multi-media exploration into important intra- and interpersonal skills required for Emotional Intelligence. Professors Sanchez-Burks and Alexander teach a model that brings together all of the areas that are necessary to improve and take skills in the interpersonal space to the next level.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/employment-contracts-65161\"><b>Employment Contracts<\/b><\/a><br \/>\n<i>University of Pennsylvania via Coursera<\/i><br \/>\nThe employment relationship is one of the foundations upon which modern society and the greater economy is built, but the nature of this relationship can be both complex and confusing. This course seeks to demystify the ways that U.S. contract law principles govern the fundamental relationship between employers and employees.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/medical-terminology-1-61423\"><b>Medical Terminology I<\/b><\/a><br \/>\n<i>Rice University via Coursera<\/i><br \/>\nThis course will discuss the importance of learning medical language as well as introduce basic word parts and concepts applied in medical terminology. We will also learn about common organization and terms seen in medical records before moving into system specific terms for the integumentary system (skin), urinary (kidneys), and musculoskeletal system (muscles and bones).<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/protect-and-grow-your-business-61458\"><b>Protect and Grow Your Freelancing Business <\/b><\/a><br \/>\n<i>California Institute of the Arts via Coursera<\/i><br \/>\nThis course presents an overview of laws surrounding freelance work and how to navigate them, how to prepare for taxes, intellectual property considerations, and how to protect one&#8217;s work through legally sound contracts and agreements.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-machine-learning-supervised-learn-60118\"><b>Introduction to Machine Learning: Supervised Learning<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nIn this course, you’ll be learning various supervised ML algorithms and prediction tasks applied to different data. You’ll learn when to use which model and why, and how to improve the model performances. We will cover models such as linear and logistic regression, KNN, Decision trees and ensembling methods such as Random Forest and Boosting, kernel methods such as SVM.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/adobe-illustrator-beginners-60058\"><b>Adobe Illustrator for Beginners<\/b><\/a><br \/>\n<i>Saint Petersburg State University via Coursera<\/i><br \/>\nThis course allows you to learn Adobe Illustrator from scratch, step by step. Adobe illustrator is a professional package for creating vector graphics, illustrating, and typesetting for print. The unique feature of the course is that it is practical and has been developed by a designer for designers.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/getting-started-making-sense-of-you-and-your-worl-60103\"><b>Getting Started with Leadership<\/b><\/a><br \/>\n<i>Queen Mary University of London via Coursera<\/i><br \/>\nIn this course, you will discover the importance of understanding context and its impact on the individual as a leader. You’ll consider how you define leadership and explore how organisations work through an exploration of the “what” and “why” of your own working environment.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/strategists-challenge-60107\"><b>The Strategist&#8217;s Challenge<\/b><\/a><br \/>\n<i>University of Virginia via Coursera<\/i><br \/>\nIn this course, you will develop your ability to think strategically, analyze the competitive environment, and recommend firm positioning and value creation. We will explore tools including SWOT, Competitor, Environmental, Five Forces, and Capabilities Analysis.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/test-and-behavior-driven-development-tdd-bdd-59776\"><b>Test and Behavior Driven Development (TDD\/BDD)<\/b><\/a><br \/>\n<i>IBM via Coursera<\/i><br \/>\nThis course introduces fundamentals of why automated testing is important, how Test-Driven Development makes you think about the requirements first and how Test-Driven Development can improve your code and save you time. You’ll learn about the various concepts of TDD, and the hands-on lab will enforce the learning of Test-Driven Development.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-digital-transformation-part-1-60117\"><b>Introduction to Digital Transformation Part 1<\/b><\/a><br \/>\n<i>University of Virginia via Coursera<\/i><br \/>\nThis course was designed to introduce the key components of digital transformation so you can understand the drivers and economics of innovation and technological change to create competitive advantage in your own industry. You&#8217;ll learn the business value of data and how the exponential growth in core technologies such as artificial intelligence and autonomy are impacting the nature of competition.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/deep-learning-methods-healthcare-64158\"><b>Deep Learning Methods for Healthcare<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nThis course covers deep learning (DL) methods, healthcare data and applications using DL methods. The courses include activities such as video lectures, self guided programming labs, homework assignments (both written and programming), and a large project.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/central-banks-monetary-policies-62884\"><b>Central Banks and Monetary Policy<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nThe purpose of this course is to provide you with an understanding of central bank policies and how such policies affect financial markets and the economy. The main aim of this course is to provide you with insights about the macroeconomic relationships between interest rates, inflation, and unemployment that allow you to assess central bank actions and appreciate how this action will affect the economy.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/technology-strategy-creative-destruction-61457\"><b>Technology Strategy: Creative Destruction<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nDrawing on many years of research, this course teaches various tools, concepts, and analytical frameworks that help to characterize and analyze strategic problems arising from innovation and technological change. In a nutshell, this course seeks to help managers and entrepreneurs navigate through the “gales of creative destruction” (a term coined by the famous economist Joseph Schumpeter) unleashed by technological innovation.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/basics-of-cost-accounting-product-costing-61451\"><b>Basics of Cost Accounting: Product Costing<\/b><\/a><br \/>\n<i>Technische Universität München (Technical University of Munich) via Coursera<\/i><br \/>\nIn this course, you&#8217;ll learn how companies record total costs and calculate unit costs for their individual products or services. For example, how can a car manufacturer figure out the costs of an individual car series?<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/data-urban-governance-60074\"><b>Data and Urban Governance<\/b><\/a><br \/>\n<i>Institut d&#8217;Etudes Politiques de Paris via Coursera<\/i><br \/>\nSince the beginning of the 2000s, cities have witnessed a massive influx of data, transforming how cities are governed. In this MOOC, we will look at this shift more closely: what has the advent of big data done to urban governance? Have platforms disrupted local authorities? How has big data changed local politics? Is it still possible to be anonymous in the city?<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/easy-vlogging-making-interactive-self-introductio-58771\"><b>Easy Vlogging – Making Interactive Self-introduction Videos<\/b><\/a><br \/>\n<i>Hong Kong Polytechnic University via edX<\/i><br \/>\nLearn how to create an engaging self-introduction video and make the strongest possible first impression to your audience. Gain both practices and technical skills in the use of camera, lighting, sound recording, video editing and more in the video production process.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/hacking-covid-19--course-3-unraveling-origins-of--61352\"><b>Hacking COVID-19: Unraveling COVID-19&#8217;s Origins<\/b><\/a><br \/>\n<i>University of California, San Diego via Coursera<\/i><br \/>\nIn this course, you will follow in the footsteps of the bioinformaticians investigating the COVID-19 outbreak by investigating the origins of SARS-CoV-2. Whether you’re new to the world of computational biology, or you’re a bioinformatics expert seeking to learn about its applications in the COVID-19 pandemic, or somewhere in between, this course is for you!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/health-data-science-foundation-64160\"><b>Health Data Science Foundation<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nThis course is intended for persons involved in machine learning who are interested in medical applications, or vice versa, medical professionals who are interested in the methods modern computer science has to offer to their field. We will cover health data analysis, different types of neural networks, as well as training and application of neural networks applied on real-world medical scenarios.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/intro-reproducibility-cancer-informatics-60069\"><b>Introduction to Reproducibility in Cancer Informatics<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nThis course introduces the concepts of reproducibility and replicability in the context of cancer informatics. It uses hands-on exercises to demonstrate in practical terms how to increase the reproducibility of data analyses. The course also introduces tools relevant to reproducibility including analysis notebooks, package managers, git and GitHub.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/the-classical-linear-regression-model-60127\"><b>The Classical Linear Regression Model<\/b><\/a><br \/>\n<i>Queen Mary University of London via Coursera<\/i><br \/>\nIn this course, you will discover the type of questions that econometrics can answer, and the different types of data you might use: time series, cross-sectional, and longitudinal data.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/ufos-scanning-the-skies-teach-out-61467\"><b>UFOs: Scanning the Skies Teach-Out<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nPeople across the world are gripped by the history of UFOs and the stories told by those who have witnessed them. In this Teach-Out, learners will hear from multidisciplinary experts about possible explanations for phenomena, what makes a UFO report compelling, and the position of UFOs within the larger conversation of science and culture.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/waseda-property-law-64237\"><b>Property Law in a Globalizing Economy: Diversity or Integration?<\/b><\/a><br \/>\n<i>Waseda University via edX<\/i><br \/>\nExplore international diversity of conveyance rules applicable to several transactions, including highly globalized ones, by comparing American law, German law, and Japanese law. Learn the approaches, to what extent, and how international harmonization should be achieved to take part in such an open-ended discussion in the future.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-number-theory-62898\"><b>Introduction to Number Theory<\/b><\/a><br \/>\n<i>Higher School of Economics via Coursera<\/i><br \/>\nIntroduction to Number Theory is an introductory course designed for a wide audience that gives a general idea of some basic concepts and statements in the field. These include divisibility, primes, Euclidean algorithm, and linear representation of the greatest common divisor. These concepts will help you to dive more deeply into the further subject.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/uas-based-mapping-laser-scanning-52891\"><b>UAS LiDAR Mapping<\/b><\/a><br \/>\n<i>Purdue University via edX<\/i><br \/>\nLearn the fundamentals of UAS-based mapping from laser scanning systems with emphasis on point positioning, system calibration, and quality control of derived point clouds\/products.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/personalised-medicine-from-a-nordic-perspective-60120\"><b>Personalised Medicine from a Nordic Perspective<\/b><\/a><br \/>\n<i>University of Copenhagen via Coursera<\/i><br \/>\nThe technical revolution has generated large amounts of data in healthcare and research, and a rapidly increasing knowledge about factors of importance for the individual’s health. This holds great potential to support a change from the one-size-fits-all paradigm to personalised or precision medicine, to guide and thereby improve each health decision of expected benefit for the patient.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/1-typology-of-countries-and-european-economies-61750\"><b>Typology of countries and European economies<\/b><\/a><br \/>\n<i>Tomsk State University via Coursera<\/i><br \/>\nThe first module will explain how the different countries of the world are divided into several groups of different economic organizations of the world. Then I will try to provide information for you about the leaders of European integration, France and Germany. And the third module is devoted to different countries of Europe, like Scandinavian countries and the UK.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/telehealth-60068\"><b>Foundations of Telehealth<\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nIn this course, students will be introduced to the key components and considerations needed to design and implement a successful telemedicine program at both the practice and health system levels. The course emphasizes operational design principles and highlights a team based approach.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/software-defined-networking-sdn-access-security-56650\"><b>Software Defined Networking (SDN) Access Security<\/b><\/a><br \/>\n<i>Curtin University via edX<\/i><br \/>\nDiscover how Software Defined Networking (SDN) can handle security and privacy issues for modern enterprise and datacenter networks.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/karl-gude-creativity-65338\"><b>How to Jumpstart Your Hidden Creative Genius<\/b><\/a><br \/>\n<i>Michigan State University via Coursera<\/i><br \/>\nDespite what you may think, there is evidence that everyone has the capacity to think creatively. This course will teach you to be much less predictable in your thinking and have the confidence and ability to generate unique, workable ideas to solve complex problems.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/acumen-academy-the-path-of-moral-leadership-58139\"><b>The Path of Moral Leadership<\/b><\/a><br \/>\n<i> via Acumen Academy<\/i><br \/>\nIn this course, you’ll access the most important principles Acumen has learned from more than 20 years working with leaders who are breaking boundaries and improving how the poor, the vulnerable, and the earth are treated.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/covid-vaccine-ambassador-61414\"><b>COVID Vaccine Ambassador Training: How to Talk to Parents <\/b><\/a><br \/>\n<i>Johns Hopkins University via Coursera<\/i><br \/>\nVaccination is a key strategy for preventing serious illness and death from COVID-19. COVID-19 vaccines are available for children 5 and older, but many parents have questions about vaccinations. This training course prepares parents of school-age children, PTAs, community members, and school staff to be Vaccine Ambassadors and promote vaccine acceptance in their communities.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/scala2-spark-big-data-64976\"><b>Big Data Analysis with Scala and Spark (Scala 2 version)<\/b><\/a><br \/>\n<i>École Polytechnique Fédérale de Lausanne via Coursera<\/i><br \/>\nWe&#8217;ll cover Spark&#8217;s programming model in detail, being careful to understand how and when it differs from familiar programming models, like shared-memory parallel collections or sequential Scala collections. Through hands-on examples in Spark and Scala, we&#8217;ll learn when important issues related to distribution like latency and network communication should be considered and how they can be addressed.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/bayesian-statistics-time-series-analysis-60133\"><b>Bayesian Statistics: Time Series Analysis<\/b><\/a><br \/>\n<i>University of California, Santa Cruz via Coursera<\/i><br \/>\nTime series analysis is concerned with modeling the dependency among elements of a sequence of temporally related variables. To succeed in this course, you should be familiar with calculus-based probability, the principles of maximum likelihood estimation, and Bayesian inference. You will learn how to build models that can describe temporal dependencies and how to perform Bayesian inference and forecasting for the models.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 35 most popular free online university courses and MOOCS starting in March 2022.<\/p>\n","protected":false},"author":156,"featured_media":75278,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[94],"tags":[500],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>35 Most Popular Online Courses Starting in March 2022 — Class Central<\/title>\n<meta name=\"description\" content=\"The 35 most popular free online university courses and MOOCS starting in March 2022.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"35 Most Popular Online Courses Starting in March 2022\" \/>\n<meta property=\"og:description\" content=\"The 35 most popular free online university courses and MOOCS starting in March 2022.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2022-02-21T08:45:47+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-22T07:31:36+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Class Central Team\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"width\":1024,\"height\":512,\"caption\":\"Most Popular Courses\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/\",\"name\":\"35 Most Popular Online Courses Starting in March 2022 — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#primaryimage\"},\"datePublished\":\"2022-02-21T08:45:47+00:00\",\"dateModified\":\"2022-09-22T07:31:36+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c\"},\"description\":\"The 35 most popular free online university courses and MOOCS starting in March 2022.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"35 Most Popular Online Courses Starting in March 2022\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c\",\"name\":\"Class Central Team\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png\",\"caption\":\"Class Central Team\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/team\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"35 Most Popular Online Courses Starting in March 2022 — Class Central","description":"The 35 most popular free online university courses and MOOCS starting in March 2022.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/","og_locale":"en_US","og_type":"article","og_title":"35 Most Popular Online Courses Starting in March 2022","og_description":"The 35 most popular free online university courses and MOOCS starting in March 2022.","og_url":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2022-02-21T08:45:47+00:00","article_modified_time":"2022-09-22T07:31:36+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_image":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Class Central Team","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","width":1024,"height":512,"caption":"Most Popular Courses"},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#webpage","url":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/","name":"35 Most Popular Online Courses Starting in March 2022 — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#primaryimage"},"datePublished":"2022-02-21T08:45:47+00:00","dateModified":"2022-09-22T07:31:36+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c"},"description":"The 35 most popular free online university courses and MOOCS starting in March 2022.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/most-popular-march-2022\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"35 Most Popular Online Courses Starting in March 2022"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c","name":"Class Central Team","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png","caption":"Class Central Team"},"url":"https:\/\/www.classcentral.com\/report\/author\/team\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/78589"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/156"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=78589"}],"version-history":[{"count":10,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/78589\/revisions"}],"predecessor-version":[{"id":78599,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/78589\/revisions\/78599"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/75278"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=78589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=78589"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=78589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}