{"id":81239,"date":"2022-07-19T05:59:25","date_gmt":"2022-07-19T12:59:25","guid":{"rendered":"https:\/\/www.classcentral.com\/report\/?p=81239"},"modified":"2022-09-22T00:29:45","modified_gmt":"2022-09-22T07:29:45","slug":"most-popular-august-2022","status":"publish","type":"post","link":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/","title":{"rendered":"40 Most Popular Online Courses Starting in August 2022"},"content":{"rendered":"<p><a href=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-75278\" src=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" alt=\"Most Popular Courses\" width=\"1024\" height=\"512\" srcset=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg 1024w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-300x150.jpg 300w, https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses-768x384.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p>\n<p>Here are the 40 most popular free online university courses and <a href=\"https:\/\/www.classcentral.com\/help\/moocs\/\">Massive Open Online Courses<\/a> (MOOCs) starting in August 2022, based on <a href=\"https:\/\/www.classcentral.com\/\">Class Central<\/a> learners’ activity.<\/p>\n<p>If you don’t find what you’re after here, either browse <a href=\"https:\/\/www.classcentral.com\/\">Class Central<\/a>’s extensive catalog of over 90K online courses via our <a href=\"https:\/\/www.classcentral.com\/subjects\">subjects page<\/a>, or have a look at our <a href=\"https:\/\/www.classcentral.com\/collections\">thematic collections<\/a>:<\/p>\n<ul>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/free-certificates\/\">Massive List of Thousands of Free Certificates and Badges<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/coursera-free-online-courses\/\">1600+ Coursera Courses That Are Still Completely Free<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/ivy-league-moocs\">450+ Free Ivy League Online Courses<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/collection\/top-free-online-courses\">The Best Online Courses of All Time<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/edx-top-courses\/\">100 Top FREE edX Courses of All Time<\/a><\/li>\n<li aria-level=\"1\"><a href=\"https:\/\/www.classcentral.com\/report\/udemy-top-courses\/\">250 Top Udemy Courses of All Time<\/a><\/li>\n<\/ul>\n<hr \/>\n<h2>Most Popular Courses<\/h2>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/cyber-security-fundamentals-92920\"><b>Cyber Security Fundamentals<\/b><\/a><br \/>\n<i>University of London International Programmes via Coursera<\/i><br \/>\nThis course is intended to provide a general introduction to key concepts in cyber security. It is aimed at anyone with a good general knowledge of information and communications technology. The nature, scope and importance of cyber security are explained, and key concepts are justified and explored. This includes examining the types of threat that cyber security must address, as well as the range of mechanisms, both technological and procedural, that can be deployed.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/database-structures-and-management-with-mysql-89713\"><b>Database Structures and Management with MySQL<\/b><\/a><br \/>\n<i>Meta via Coursera<\/i><br \/>\nDevelop a working knowledge of the MySQL database management system (DBMS). Gain DBMS skills such as data creation, querying and manipulation. You’ll gain further experience with SQL statements, clauses and data types.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-strategic-sales-management-91743\"><b>Strategic Sales Management<\/b><\/a><br \/>\n<i>IIT Roorkee via Swayam<\/i><br \/>\nThe ongoing rapid transformation in the business world certainly calls for a strategic approach to sales and selling management. With the ever-increasing competition and high commoditization, an effective and skilled sales force undoubtedly plays a key role in retaining and capturing markets. The course is designed to discuss selling from a strategic standpoint in a highly volatile, uncertain, complex and ambiguous business world with the key objective of preparing learners for crafting effective sales management strategies.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/application-security-and-monitoring-59777\"><b>Application Security and Monitoring<\/b><\/a><br \/>\n<i>IBM via Coursera<\/i><br \/>\nThis course describes security best practices that developers follow when developing applications. It also teaches you how to effectively monitor and troubleshoot applications using related tools. You will complete a final project in which you will deploy and update an application you have created using your newly acquired monitoring skills. You will publish this project through your GitHub repository to share your skills with your peers and prospective employers.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/the-discipline-of-leadership-94432\"><b>The Discipline of Leadership<\/b><\/a><br \/>\n<i>University of Notre Dame via Coursera<\/i><br \/>\nBecause it is likely you either want to improve your leader effectiveness or you may want to increase the number of leadership opportunities you have, this course will focus on outlining the factors that predict leader emergence (whether someone will emerge as a leader) and leader effectiveness.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-introduction-to-computer-and-network-performance-analysis-using-queuing-systems-91689\"><b>Introduction to Computer and Network Performance Analysis using Queuing Systems<\/b><\/a><br \/>\n<i>IIT Bombay via Swayam<\/i><br \/>\nAnalyzing the performance of any computer or networked system: such as Web application servers, packet scheduling disciplines, operating system schedulers, cellular telephony networks is an important step in the design and deployment of such systems. The focus in this short course will be on being able to reason about asymptotic values of performance metrics at high loads and low loads, which is very useful in validating results of performance tests.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/investment-banking-financial-analysis-valuation-93361\"><b>Investment Banking: Financial Analysis and Valuation<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nThis course will provide students the key building blocks required for a career in investment banking, valuation, and other corporate-finance focused fields. It is designed to provide a practical application of financial statement analysis and valuation techniques commonly performed by industry professionals.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/linux-system-programming-introduction-to-buildroo-92448\"><b>Linux System Programming and Introduction to Buildroot<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course provides an overview of System Programming for the Linux operating system, or software which is interfacing directly with the Linux Kernel and C library. The basic components of a Linux Embedded System, including kernel and root filesystem details are discussed. The Buildroot build system is introduced, which students use to build their own custom Embedded Linux system through programming assignments.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/principles-of-ui-ux-89708\"><b>Principles of UI\/UX Design<\/b><\/a><br \/>\n<i>Meta via Coursera<\/i><br \/>\nLearn the fundamentals of User Experience (UX) research and design. You’ll learn how UX insights relate to design decisions and how accessibility affects users. You’ll get a brief tour in modern User Interface (UI) design, learn the basics of Figma, and understand the importance of micro interactions. By utilizing the UI design process, you will be able to create Minimum Viable Product (MVP) style prototypes from your mockups.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/data-analysis-with-tidyverse-93336\"><b>Data Analysis with Tidyverse<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course continues our gentle introduction to programming in R designed for 3 types of learners. You will use learn to use readr to read in your data, dplyr to analyze your data, and stringr and forcats to manipulate strings and factors.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/software-defined-networking-sdn-deployment-56651\"><b>Software Defined Networking (SDN) Deployment<\/b><\/a><br \/>\n<i>Curtin University via edX<\/i><br \/>\nBecome industry ready by learning advanced skills in network automation, including how to deploy virtual network functions and services on a testbed platform.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-sociology-and-resource-management-91734\"><b>Sociology and Resource Management<\/b><\/a><br \/>\n<i>Indian Institute of Technology, Kharagpur via Swayam<\/i><br \/>\nThe aim of this course is to bring in various sociological dimensions of managing and governing resources be it a natural resource such as land, water, fisheries, forest or a man-made resource like internet, knowledge, culture, etc. The course will reflect on different perspectives on conservation practices, socio-political context, technical and cultural interaction between resources and different stakeholders.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/quality-improvement-for-population-health-93364\"><b>Quality Improvement for Population Health<\/b><\/a><br \/>\n<i>Imperial College London via Coursera<\/i><br \/>\nQuality improvement methods were first deployed in healthcare in e hospital settings. However, over the past decade particularly, there has been increasing focus on the application of these methods in improving population and public health. In this course, you will apply a combination of both approaches to population health improvement.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-introduction-to-cell-biology-93308\"><b>Introduction to Cell Biology<\/b><\/a><br \/>\n<i>Indian Institute of Science Education and Research, Pune via Swayam<\/i><br \/>\nThis course aims to introduce students to biomolecules and important fundamental concepts in cellular biochemistry, genetics and cellular organisation. It is aimed to give you an insight into how biomolecules work and help drive cellular architecture and function in a eukaryotic cell.<b><\/b><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/unsupervised-learning-recommenders-reinforcement--93343\"><b>Unsupervised Learning, Recommenders, Reinforcement Learning<\/b><\/a><br \/>\n<i>DeepLearning.AI via Coursera<\/i><br \/>\nIn the third course of the Machine Learning Specialization, you will: • Use unsupervised learning techniques for unsupervised learning: including clustering and anomaly detection. • Build recommender systems with a collaborative filtering approach and a content-based deep learning method. • Build a deep reinforcement learning model.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-patent-search-and-analysis-91718\"><b>Patent Search and Analysis<\/b><\/a><br \/>\n<i>Indian Institute of Technology, Kharagpur via Swayam<\/i><br \/>\nPatents are legal documents which provide the basis of an invention and the extent to which rights are covered in relation to an invention. One of the indicators for a country’s innovative ability is patenting index and patents are considered to be the highest in the innovative index. Search for patent information is undertaken for various purposes. Understanding technology trends, gaining an insight into lead technologies, forming a part of literature search before embarking on R&amp;D, determining patentability of an invention, freedom to operate searches before product entry into market are some of the predominant reasons for patent search.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/tools-and-practices-for-addressing-pandemic-chall-93328\"><b>Tools and Practices for Addressing Pandemic Challenges<\/b><\/a><br \/>\n<i>Politecnico di Milano via Coursera<\/i><br \/>\nAn overview of the tools, techniques, and practices that can be enacted by policy makers, countries, and organizations to monitor, manage, and react to pandemics and mitigate and govern their impacts. An introductory, multidisciplinary course covering data science, social science, healthcare, and management, paving the way to various courses on specific matters.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-design-of-connections-in-steel-structures-91656\"><b>Design of connections in steel structures<\/b><\/a><br \/>\n<i>IIT Hyderabad via Swayam<\/i><br \/>\nThe course “Design of Connections in Steel Structures” helps students understand the fundamental mechanism of how different types of connections behave and how the analysis and design process accounts for their behaviour.<\/p>\n<div><a href=\"https:\/\/www.classcentral.com\/course\/swayam-urban-sociology-91747\"><b>Urban Sociology<\/b><\/a><\/div>\n<div><i>Indian Institute of Technology, Kharagpur via Swayam<\/i><\/div>\n<div>\n<div>We live in a world that currently faces multiple challenges of enormous magnitude, due to the effects of urbanization. With the rate, scale and shifting geographies of urbanization in the global South, it is important to map both challenges associated with and opportunities offered by cities.<\/div>\n<\/div>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-electronic-properties-of-the-materials-computational-approach-91667\"><b>Electronic Properties of the Materials: Computational Approach<\/b><\/a><br \/>\n<i>Indian Institute of Technology Kanpur via Swayam<\/i><br \/>\nThe course aims to explain the physics of electronic materials in detail, followed by a brief discussion on their applications. A student taking the course will learn about traditional metals, semiconductors, and ionic-conductors, as well as newly discovered low-dimensional materials.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/crispr-gene-editing-teach-out-92866\"><b>CRISPR Gene Editing Teach-Out<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nCRISPR is a genetic engineering technique, but just one of many. Genetic engineering dates back to the 1970s, and has had far-reaching benefits for medicine, biomedical research, agriculture, and industrial applications. Among types of genetic engineering techniques, CRISPR is important because it is highly precise, cost effective, and very efficient.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-to-management-consulting-94671\"><b>Introduction to Management Consulting<\/b><\/a><br \/>\n<i>Emory University via Coursera<\/i><br \/>\nManagement consultants are paid well because they help executives to break down complex problems, make difficult decisions, and implement lasting change. Consultants know how to work smart and fast. Companies like McKinsey, Bain, BCG, Deloitte, EY, PWC, KPMG, and Accenture have trained thousands of consultants on useful skills, tools, methodologies.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-laser-based-manufacturing-91696\"><b>Laser Based Manufacturing<\/b><\/a><br \/>\n<i>Indian Institute of Technology Guwahati via Swayam<\/i><br \/>\nThis is a basic course on applications of laser technology in manufacturing. The subject laser technology has a very wide range of applications in the product development, manufacturing, surface engineering, and instrumentation. The course emphasizes the fundamental concepts of the laser technology viz. principle of working, characteristics, types, monitoring and control.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/virology-epidemiology-92431\"><b>Virology and Epidemiology in the Time of COVID-19<\/b><\/a><br \/>\n<i>American Museum of Natural History via Coursera<\/i><br \/>\nThis course covers the science and social impacts of viral infectious diseases. We will begin by covering the basics: what a virus is, the structural and functional diversity of viruses, and how viruses use our bodies and the bodies of other organisms to replicate. Then we will dive into the human response: how our immune systems work to protect us from pathogenic viruses and how we use science and social systems to fend off viruses through vaccines and public health measures.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/oncofertility-overview-94368\"><b>The Emergence of Oncofertility (Past, Present &amp; Future)<\/b><\/a><br \/>\n<i>Michigan State University via Coursera<\/i><br \/>\nOncofertility is a new interdisciplinary field at the intersection of oncology and reproductive medicine that aims to provide effective fertility options to young cancer patients undergoing gonadotoxic anticancer therapy through several fertility preservation and restoration strategies. This course aims to provide participants with an exciting learning curve to ensure they understand the fundamentals of oncofertility and help them advance their career.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-modern-indian-architecture-91708\"><b>Modern Indian Architecture<\/b><\/a><br \/>\n<i>Indian Institute of Technology Roorkee via Swayam<\/i><br \/>\nThis course will take you through an interesting journey on the evolution of modern architecture in India from pre-independence to the present time. This evolution will be seen through various modern trends and building typologies, covering many buildings over a span of nearly a century, not only of masters like Charles Correa and B.V. Doshi, but also many other architects who have made a significant contribution in the development of a modern Indian architecture.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/translating-research-to-health-care-policy-94437\"><b>Translating Research to Healthcare Policy<\/b><\/a><br \/>\n<i>University of Michigan via Coursera<\/i><br \/>\nIn this course, you will learn about the process of evaluating the real-world outcomes of health research. You will learn important terminology and concepts as you explore how the outcomes of health research can influence health policy and practice. The readings, videos, and activities in this course should be completed in the order they are presented to ensure that you will have the best learning experience possible.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/why-business-94877\"><b>Why Business? What is the Role of Business in a Just and Humane Society<\/b><\/a><br \/>\n<i>University of Notre Dame via Coursera<\/i><br \/>\nThe course examines the common perceptions of business (both positive and negative) and the role of business in a market economy by first introducing the main elements of a market economy, and then presenting opposing points of view of this economic model.The course encourages reflection upon the possibility that business can be honorable and play a role in a just and humane society.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/swayam-geometry-of-vision-91677\"><b>Geometry of Vision<\/b><\/a><br \/>\n<i>Chennai Mathematical Institute via Swayam<\/i><br \/>\nThis course will explore how one of our senses &#8212; our sense of sight &#8212; relies on our brain&#8217;s seemingly hardwired understanding of a fascinating geometric space. What&#8217;s more, this space &#8212; known as the two dimensional Projective Plane &#8212; is surprisingly different from the familiar Euclidean plane.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/climate-change-nj-93370\"><b>Climate and Climate Change in New Jersey<\/b><\/a><br \/>\n<i>American Museum of Natural History via Coursera<\/i><br \/>\nWelcome to the American Museum of Natural History&#8217;s (AMNH) primer called Climate and Climate Change in New Jersey! This primer includes numerous elements that will provide you with an understanding of our climate system and climate change in New Jersey, and encourage you to think about viable solutions for climate change impacts.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/sscp-4th-ed-course-1-94887\"><b>Introducing Security: Aligning Asset and Risk Management<\/b><\/a><br \/>\n<i>(ISC)² via Coursera<\/i><br \/>\nIntroducing Security and Aligning Asset Management to Risk Management In this course, we&#8217;re going to start by discussing the security concepts, identifying corporate assets, and discussing the risk management process.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/upcycling-and-the-circular-economy-ghanian-creati-94642\"><b>Upcycling and the Circular Economy: Ghanaian Creative Solutions to Global Textile Waste<\/b><\/a><br \/>\n<i>Hopenclass via FutureLearn<\/i><br \/>\nExplore the environmental impact of fast fashion in Ghana and discover localised solutions to a global issue.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/playing-with-fire-57929\"><b>Playing with Fire!<\/b><\/a><br \/>\n<i>Hong Kong Polytechnic University via edX<\/i><br \/>\n‘Playing with Fire’ introduces the complex challenge fire hazard represents to human activities. While learning about fundamentals of fire science and how professionals deal with this hazard, you’ll learn things like why a candle flame has the shape it has and how firefighters use fire to suppress fire.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/actors-discuss-romeo-and-juliet-94545\"><b>Perspectives from the Stage: Actors Discuss Romeo and Juliet<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nThis course is meant for anyone who is reading Romeo &amp; Juliet and would like to hear the perspectives of professional actors who have performed in the play.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/the-social-dimensions-of-antimicrobial-resistance-94882\"><b>The Social Dimensions of Antimicrobial Resistance<\/b><\/a><br \/>\n<i>University of Amsterdam via Coursera<\/i><br \/>\nSonar-Global is a collaborative work to mobilize social sciences against infectious threats. It is a sustainable international network to strengthen the active participation of the social sciences in the prevention and response to infectious threats, including those posed by antimicrobial resistance (AMR) and vaccine hesitancy. The Sonar-Global&#8217;s Social Dimensions of Antimicrobial Resistance MOOC is an independent course for non-social scientists who want to know more about the social dimensions of AMR.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/introduction-python-fundamentals-95200\"><b>Introduction to Python Fundamentals<\/b><\/a><br \/>\n<i>University of Colorado Boulder via Coursera<\/i><br \/>\nHow many times have you decided to learn a programming language but got stuck somewhere along the way, grew frustrated, and gave up? This course will introduce you to programming languages, with Python as an example. You are going to learn how to use variables and operators, as well as input\/output and flow controls to build simple Python programs. The pace will be very slow, so you will feel comfortable learning Python as quickly or as slowly as you like. Are you ready? Let&#8217;s go!<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/necessary-condition-analysis-95169\"><b>Necessary Condition Analysis (NCA)<\/b><\/a><br \/>\n<i>Erasmus University Rotterdam via Coursera<\/i><br \/>\nWelcome to Necessary Condition Analysis (NCA). NCA analyzes data using necessity logic. A necessary condition implies that if the condition is not in place, there will be guaranteed failure of the outcome. The opposite however is not true; if the condition is in place, success of the outcome is not guaranteed. Examples of necessary conditions are a student’s GMAT score for admission to a PhD program; a student will not be admitted to a PhD program when his GMAT score is too low.<b><\/b><\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/leading-teams-developing-as-a-leader-96571\"><b>Leading Teams: Developing as a Leader<\/b><\/a><br \/>\n<i>University of Illinois at Urbana-Champaign via Coursera<\/i><br \/>\nIn this foundational course, you will be challenged to develop as a leader. You will explore the concept of leadership, assess required competencies for today&#8217;s leaders, learn more about yourself and how you can make effective and ethical decisions, identify how to build trusting relationships with others, and articulate a practice for growing as a leader.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/exploring-inclusive-pedagogies-96586\"><b>Exploring Inclusive Pedagogies<\/b><\/a><br \/>\n<i>British Council via FutureLearn<\/i><br \/>\nEnsure you’re meeting every learner’s needs, including those most at risk of exclusion, by developing inclusive teaching skills.<\/p>\n<p><a href=\"https:\/\/www.classcentral.com\/course\/epistemology-95207\"><b>The Epistemic Quest for Truth: Introduction to epistemology<\/b><\/a><br \/>\n<i>Erasmus University Rotterdam via Coursera<\/i><br \/>\nThe introduction of the internet and of social media has drastically changed our information position. We live in a time of ‘truth decay’: the distinction between opinions and facts is blurred, opinions have more impact than facts, and sources of factual information are increasingly distrusted. Since philosophers love truth, they deplore these tendencies. But what can they do about them? In this course, you will be invited to reflect on whether, in what sense and to what extent, 2500 years of normative epistemology, or theory of knowledge, can be put into practice and help to reduce truth decay.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The 40 most popular free online university courses and MOOCs starting in August 2022.<\/p>\n","protected":false},"author":156,"featured_media":75278,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[94],"tags":[500],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v18.3 (Yoast SEO v18.5.1) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>40 Most Popular Online Courses Starting in August 2022 — Class Central<\/title>\n<meta name=\"description\" content=\"The 40 most popular free online university courses and MOOCs starting in August 2022.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"40 Most Popular Online Courses Starting in August 2022\" \/>\n<meta property=\"og:description\" content=\"The 40 most popular free online university courses and MOOCs starting in August 2022.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/\" \/>\n<meta property=\"og:site_name\" content=\"The Report by Class Central\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/classcentral\" \/>\n<meta property=\"article:published_time\" content=\"2022-07-19T12:59:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-09-22T07:29:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@classcentral\" \/>\n<meta name=\"twitter:site\" content=\"@classcentral\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Class Central Team\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\",\"url\":\"https:\/\/www.classcentral.com\/report\/\",\"name\":\"The Report by Class Central\",\"description\":\"MOOC News, Interviews, and Analysis\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.classcentral.com\/report\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg\",\"width\":1024,\"height\":512,\"caption\":\"Most Popular Courses\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#webpage\",\"url\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/\",\"name\":\"40 Most Popular Online Courses Starting in August 2022 — Class Central\",\"isPartOf\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#primaryimage\"},\"datePublished\":\"2022-07-19T12:59:25+00:00\",\"dateModified\":\"2022-09-22T07:29:45+00:00\",\"author\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c\"},\"description\":\"The 40 most popular free online university courses and MOOCs starting in August 2022.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Report\",\"item\":\"https:\/\/www.classcentral.com\/report\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"40 Most Popular Online Courses Starting in August 2022\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c\",\"name\":\"Class Central Team\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.classcentral.com\/report\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png\",\"contentUrl\":\"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png\",\"caption\":\"Class Central Team\"},\"url\":\"https:\/\/www.classcentral.com\/report\/author\/team\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"40 Most Popular Online Courses Starting in August 2022 — Class Central","description":"The 40 most popular free online university courses and MOOCs starting in August 2022.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/","og_locale":"en_US","og_type":"article","og_title":"40 Most Popular Online Courses Starting in August 2022","og_description":"The 40 most popular free online university courses and MOOCs starting in August 2022.","og_url":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/","og_site_name":"The Report by Class Central","article_publisher":"https:\/\/www.facebook.com\/classcentral","article_published_time":"2022-07-19T12:59:25+00:00","article_modified_time":"2022-09-22T07:29:45+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@classcentral","twitter_site":"@classcentral","twitter_misc":{"Written by":"Class Central Team","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.classcentral.com\/report\/#website","url":"https:\/\/www.classcentral.com\/report\/","name":"The Report by Class Central","description":"MOOC News, Interviews, and Analysis","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.classcentral.com\/report\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2021\/04\/popular-courses.jpg","width":1024,"height":512,"caption":"Most Popular Courses"},{"@type":"WebPage","@id":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#webpage","url":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/","name":"40 Most Popular Online Courses Starting in August 2022 — Class Central","isPartOf":{"@id":"https:\/\/www.classcentral.com\/report\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#primaryimage"},"datePublished":"2022-07-19T12:59:25+00:00","dateModified":"2022-09-22T07:29:45+00:00","author":{"@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c"},"description":"The 40 most popular free online university courses and MOOCs starting in August 2022.","breadcrumb":{"@id":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.classcentral.com\/report\/most-popular-august-2022\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Report","item":"https:\/\/www.classcentral.com\/report\/"},{"@type":"ListItem","position":2,"name":"40 Most Popular Online Courses Starting in August 2022"}]},{"@type":"Person","@id":"https:\/\/www.classcentral.com\/report\/#\/schema\/person\/bd52f0d81ab017bcbdbcbf0b93af453c","name":"Class Central Team","image":{"@type":"ImageObject","@id":"https:\/\/www.classcentral.com\/report\/#personlogo","inLanguage":"en-US","url":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png","contentUrl":"https:\/\/www.classcentral.com\/report\/wp-content\/uploads\/2022\/09\/cc-logo-navy-120x120.png","caption":"Class Central Team"},"url":"https:\/\/www.classcentral.com\/report\/author\/team\/"}]}},"_links":{"self":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/81239"}],"collection":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/users\/156"}],"replies":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/comments?post=81239"}],"version-history":[{"count":6,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/81239\/revisions"}],"predecessor-version":[{"id":81307,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/posts\/81239\/revisions\/81307"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media\/75278"}],"wp:attachment":[{"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/media?parent=81239"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/categories?post=81239"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.classcentral.com\/report\/wp-json\/wp\/v2\/tags?post=81239"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}